{
    "title": "gs",
    "child": {
        "child1": {
            "question": "Q. Highlight the Central Asian and Greco -Bactrian elements in the Gandhara art. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "ancient ",
                "art and culture ",
                "art & culture ",
                "history\n"
            ]
        },
        "child2": {
            "question": "Q. The 1857 Uprising was the culmination of the recurrent big and small local rebellions that had occurred in the preceding hundred years of British rule. Elucidate (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "modern ",
                "history\n"
            ]
        },
        "child3": {
            "question": "Q. Examine the linkages between 19th centuries ‘Indian renaissance’ and emergence of national identity. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "modern ",
                "history\n"
            ]
        },
        "child4": {
            "question": "Q. Assess the impact of global warming on coral life system with examples. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "geography\n"
            ]
        },
        "child5": {
            "question": "Q.Discuss the causes of depletion of mangroves and explain their importance in maintaining coastal ecology. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "geography\n"
            ]
        },
        "child6": {
            "question": "Q. Can the strategy of regional-resource based manufacturing help in promoting employment in India? (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "geography ",
                "resources\n"
            ]
        },
        "child7": {
            "question": "Q. Discuss the factors for localization of agro-based food processing industries of North West India. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "geography ",
                "resources\n"
            ]
        },
        "child8": {
            "question": "Q. What makes the Indian society unique in sustaining its culture? Discuss. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "society\n"
            ]
        },
        "child9": {
            "question": "Q. “Empowering women is the key to control population growth”. Discuss (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "society\n"
            ]
        },
        "child10": {
            "question": "Q. What are the challenges to our cultural practices in the name of secularism (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "society\n"
            ]
        },
        "child11": {
            "question": "Q. Many voices had strengthened and enriched the nationalist movement during the Gandhian phase. Elaborate (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "modern ",
                "history\n"
            ]
        },
        "child12": {
            "question": "Q. Assess the role of British imperial power in complicating the process of transfer of power during 1940s. (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "modern ",
                "history\n"
            ]
        },
        "child13": {
            "question": "Q. Explain how the foundations of modern world were laid by the American and French revolution. (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "world history ",
                "history\n"
            ]
        },
        "child14": {
            "question": "Q. What is water stress? How and why does it differ regionally in India? (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "geography ",
                "resources\n"
            ]
        },
        "child15": {
            "question": "Q. How can the mountain ecosystem be restored from the negative impact of development initiatives and tourism? (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "geography\n"
            ]
        },
        "child16": {
            "question": "Q. How is efficient and affordable urban mass transport key to the rapid economic development of India? (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "geography\n"
            ]
        },
        "child17": {
            "question": "Q. How do ocean currents and water masses differ in their impacts on marine life and coastal environment? Give suitable examples? (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "geography\n"
            ]
        },
        "child18": {
            "question": "Q. Do we have cultural pockets of small India all over the nation? Elaborate with examples (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1  ",
                "society\n"
            ]
        },
        "child19": {
            "question": "Q. What are the continued challenges for women in India against time and space? (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "society\n"
            ]
        },
        "child20": {
            "question": "Q. Are we losing our local identity for the global identity? Discuss.  (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs1 ",
                "society\n"
            ]
        },
        "child21": {
            "question": "Q. Do you think Constitution of India does not accept principle of strict separation of powers rather it is based on the principle of ‘checks and balance’? Explain. (10 Marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "polity\n"
            ]
        },
        "child22": {
            "question": "Q. “The Central Administrative Tribunal which was established for redressal of grievances and complaints by or against central government employees, nowadays is exercising its powers as an independent judicial authority.” Explain. (10 Marks)     ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "polity\n"
            ]
        },
        "child23": {
            "question": "Q. What are the methods used by the farmer’s organizations to influence the policy-makers in India and how effective are these methods? (10 Marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "polity\n"
            ]
        },
        "child24": {
            "question": "Q. From the resolution of contentious issues regarding distribution of legislative powers by the courts, ‘Principle of Federal Supremacy’ and ‘Harmonious Construction’ have emerged. Explain. (10 Marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "polity ",
                "judiciary ",
                "constitution\n"
            ]
        },
        "child25": {
            "question": "Q. What can France learn from the Indian Constitution’s approach to secularism? (10 Marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "polity ",
                "governance\n"
            ]
        },
        "child26": {
            "question": "Q. Despite Consistent experience of high growth, India still goes with the lowest indicators of human development. Examine the issues that make balanced and inclusive development elusive. (10 Marks)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs2    ",
                "governance\n"
            ]
        },
        "child27": {
            "question": "Q. There is a growing divergence in the relationship between poverty and hunger in India. The shrinking of social expenditure by the government is forcing the poor to spend more on non-food essential items squeezing their food-budget – Elucidate. (10 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "governance\n"
            ]
        },
        "child28": {
            "question": "Q. Implementation of Information and Communication technology (ICT) based projects/programmes usually suffers in terms of certain vital factors. Identify these factors and suggest measures for their effective implementation. (10 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "governance\n"
            ]
        },
        "child29": {
            "question": "Q. ‘The time has come for India and Japan to build a strong contemporary relationship, one involving global and strategic partnership that will have a great significance for Asia and the world as a whole.’ Comment. (10 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "ir\n"
            ]
        },
        "child30": {
            "question": "Q. ‘Too little cash, too much politics, leaves UNESCO fighting for life.’ Discuss the statement in the light of US’ withdrawal and its accusation of the cultural body as being ‘anti-Israel bias’. (10 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "ir\n"
            ]
        },
        "child31": {
            "question": "Q. On what grounds a people’s representative can be disqualified under the representation of people act, 1951? Also mention the remedies available to such person against his disqualification. (15 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "polity ",
                "RPA\n"
            ]
        },
        "child32": {
            "question": "Q. “Parliament’s power to amend the constitution is a limited power and it cannot be enlarged into absolute power”. In the light of this statement explain whether parliament under article 368 of the constitution can destroy the Basic structure of the constitution by expanding its amending power? (15 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "polity ",
                "constitution\n"
            ]
        },
        "child33": {
            "question": "Q. “The reservation of seats for women in the institution of local self-government has had a limited impact on the patriarchal character of the Indian political process”. Comment. (15 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "polity ",
                "constitution\n"
            ]
        },
        "child34": {
            "question": "Q. “The Attorney-General is the chief legal adviser and lawyer of the Government of India.” Discuss  (15 Marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "polity ",
                "constitution\n"
            ]
        },
        "child35": {
            "question": "Q. Individual parliamentarian’s role as the national law maker is on a decline, which in turn, has adversely impacted the quality of debates and their outcome. Discuss. (15 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "polity\n"
            ]
        },
        "child36": {
            "question": "Q. ‘In the context of neo-liberal paradigm of developmental planning, multi-level planning is expected to make operations cost-effective and remove many implementation blockages’- Discuss (15 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "governance\n"
            ]
        },
        "child37": {
            "question": "Q. The need for cooperation among various service sectors has been an inherent component of development discourse. Partnership bridges the gap among the sectors. It also sets in motion a culture of ‘collaboration’ and ‘team spirit’. In the light of statements above examine India’s development process. (15 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2  ",
                "governance\n"
            ]
        },
        "child38": {
            "question": "Q. Performance of welfare schemes that are implemented for vulnerable sections is not so effective due to absence of their awareness and active involvement at all stages of policy process. Discuss (15 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "governance\n"
            ]
        },
        "child39": {
            "question": "Q. “The long sustained image of India as a leader of the oppressed and marginalised nations has disappeared on account of its new found role in the emerging global order.’ Elaborate (15 Marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "ir\n"
            ]
        },
        "child40": {
            "question": "Q. What introduces friction into the ties between India and United States is that Washington is still unable to find for India a position in its global strategy, which would satisfy India’s national self-esteem and ambitions’. Explain with suitable examples. (15 Marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs2   ",
                "ir\n"
            ]
        },
        "child41": {
            "question": "Q. Enumerate the indirect taxes which have been subsumed in the Goods and Services Tax (GST) in India. Also, comment on the revenue implications of the GST introduced in India since July 2017. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "economy\n"
            ]
        },
        "child42": {
            "question": "Q. Do you agree with the view that steady GDP growth and low inflation have left the Indian economy in good shape? Give reasons in support of your arguments. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "economy\n"
            ]
        },
        "child43": {
            "question": "Q. How far is Integrated Farming System (IFS) helpful in sustaining agricultural production? (Answer in 150 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "economy ",
                "agriculture\n"
            ]
        },
        "child44": {
            "question": "Q. Elaborate the impact of National Watershed Project in increasing agricultural production from water-stressed areas. (Answer in 150 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "agriculture\n"
            ]
        },
        "child45": {
            "question": "Q. How was India benefitted from the contributions of Sir M.Visvesvaraya and Dr. M. S. Swaminathan in the fields of water engineering and agricultural science respectively? (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "agriculture\n"
            ]
        },
        "child46": {
            "question": "Q. What is India’s plan to have its own space station and how will it benefit our space programme? (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "science and tech\n"
            ]
        },
        "child47": {
            "question": "Q.  Coastal sand mining, whether legal or illegal, poses one of the biggest threats to our environment. Analyse the impact of sand mining along the Indian coasts, citing specific examples. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "environment\n"
            ]
        },
        "child48": {
            "question": "Q. Vulnerability is an essential element for defining disaster impacts and its threat to people. How and in what ways can vulnerability to disasters be characterized? Discuss different types of vulnerability with reference to disasters. (Answer in 150 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "disaster management\n"
            ]
        },
        "child49": {
            "question": "Q. The banning of ‘Jamaat-e – islaami’ in Jammu and Kashmir brought into focus the role of over-ground workers (OGWs) in assisting terrorist organizations. Examine the role played by OGWs in assisting terrorist organizations in insurgency affected areas. Discuss measures to neutralize influence of OGWs. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "internal security\n"
            ]
        },
        "child50": {
            "question": "Q. What is CyberDome Project? Explain how it can be useful in controlling internet crimes in India. (Answer in 150 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "science and tech ",
                "internal security\n"
            ]
        },
        "child51": {
            "question": "Q. It is argued that the strategy of inclusive growth is intended to meet the objectives of inclusiveness and sustainability together. Comment on this statement. (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "economy\n"
            ]
        },
        "child52": {
            "question": "Q. The public expenditure management is a challenge to the government of India in the context of budget making during the post-liberalization period. Clarify it. (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "economy\n"
            ]
        },
        "child53": {
            "question": "Q. What are the reformative steps taken by the government to make food grain distribution system more effective? (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "economy ",
                "agriculture\n"
            ]
        },
        "child54": {
            "question": "Q. Elaborate the policy taken by the government of India to meet the challenges of the food processing sector. (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "agriculture\n"
            ]
        },
        "child55": {
            "question": "Q. How is the government of India protecting traditional knowledge of medicine from patenting by pharmaceutical companies? (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "science and tech\n"
            ]
        },
        "child56": {
            "question": "Q. How can biotechnology improve the living standards of farmers? (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "agriculture ",
                "science and tech\n"
            ]
        },
        "child57": {
            "question": "Q. Define the concept of carrying capacity of an ecosystem as relevant to an environment. Explain how understanding this concept is vital while planning for sustainable development of a region. (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "environment\n"
            ]
        },
        "child58": {
            "question": "Q. Disaster preparedness is the first step in any disaster management process. Explain how hazard zonation mapping will help in disaster mitigation in the case of landslides. (Answer in 250 words) ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "disaster management\n"
            ]
        },
        "child59": {
            "question": "Q. Indian government has recently strengthened the anti-terrorism laws by amending the unlawful activities (Prevention) act (UAPA), 1967 and the NIA Act. Analyze the changes in the context of prevailing security environment while discussing the scope and reasons for opposing the UAPA by human rights organizations. (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "internal security\n"
            ]
        },
        "child60": {
            "question": "Q. Cross-border movement of insurgents is only one of the several security challenges facing the policing of the border in North-East India. Examine the various challenges currently emanating across the India-Myanmar border. Also discuss the steps to counter the challenges. (Answer in 250 words)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs3 ",
                "internal security\n"
            ]
        },
        "child61": {
            "question": "Q.      (a) What are the basic principles of public life? Illustrate any three with suitable examples. (150 words) (10 marks)      (b) What do you understand by the term ‘public servant’? Reflect on the expected role of public servant.  (150 words) (10 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics\n"
            ]
        },
        "child62": {
            "question": "Q.   (a) Effective utilization of public finds is crucial to meet development goals. Critically examine the reasons for under- utilization and mis- utilization of public funds and their implications. (150 words) (10 marks)      (b) “Non-performance of duty by a public servant is a form of corruption”. Do you agree with this view? Justify your answer (150 words) (10 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics\n"
            ]
        },
        "child63": {
            "question": "Q.     (a) What is meant by the term ‘constitutional morality’? How does one uphold constitutional morality? (150 words) (10 marks)      (b) What is meant by ‘crisis of conscience’? How does it manifest in the public domain? (150 words) (10 marks)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics\n"
            ]
        },
        "child64": {
            "question": "Q.     (a) Explain the basic principles of citizens’ charter movement and bring out its importance. (150 words) (10 marks)      (b) There is a view that the official secrets act is an obstacle to the implementation of Rights to Information act. Do you agree with the view? Discuss (150 words) (10 marks)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics\n"
            ]
        },
        "child65": {
            "question": "Q.     (a) What do you understand by probity in governance? Based on your understanding of the term, suggest measures for ensuring probity in government. (150 words) (10 marks)     (b) “Emotional Intelligence is the ability to make your emotions work for you instead of against you.” Do you agree with this view? Discuss. (150 words) (10 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics\n"
            ]
        },
        "child66": {
            "question": "Q. What do each of the following quotations mean to you?      (a) “An unexamined life is not worth living.” – Socrates (150 words) (10 marks)      (b) “A man is but the product of his thoughts. What he thinks, he becomes.” – M.K.Gandhi (150 words) (10 marks)      (c) “Where there is righteousness in the heart, there is beauty in the character. When there is beauty in the character, there is harmony in the home. When there is harmony in the home, there is order in the nation. When there is order in the nation, there is peace in the world.” – A.P.J. Abdul Kalam (150 words) (10 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics\n"
            ]
        },
        "child67": {
            "question": "Q. You are the heading the rescue operations in a area affected by severe natural calamity, thousands of people are rendered homeless and deprived of food, drinking water and other basic amenities. Rescue work has been disrupted by heavy rainfall and damaged to supply routes. The local people are seeding with anger against the delayed limited rescue operations. When your team reaches the affected area, the people there heckle and even assault some of the team members. One of your team member is even severely injured. Faced with this crisis some team member plead with you to call off the operations freeing threats to their life.       In such trying circumstances, what will be your response? Examine the qualities of a public servant which will be required to manage the situations. (250 words) (20 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics ",
                "case studies\n"
            ]
        },
        "child68": {
            "question": "Q.      Honesty and uprightness are the hallmarks of a civil servants. Civil servants possessing these qualities are considered as a back bone of any strong organizations. In line of duty, they take various decisions, at time some become bonafide mistakes. As long as such decisions, are not taken intentionally and do not benefit personally, the officer cannot be said to be guilty. Though such decisions may, at times, lead to unforeseen adverse consequences in the long term.     In the recent past, a few instances have surfaced where in civil servants has been implicated for bonafide mistakes. They have often been prosecuted and even imprisoned. These instances have greatly rattled the moral fiber of the civil servants.       How does this trend affect the functioning of civil services? What measures can be taken to ensure that honest civil servants are not implicated for bonafide mistakes on their part? Justify your answer. (250 words) (20 marks)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics ",
                "case studies\n"
            ]
        },
        "child69": {
            "question": "Q. An apparel manufacturing company having large number of women employees was losing sales due to various factors. The company hired a reputed marketing executive, who increased the volume of sales within a short span of time. However, some unconfirmed reports came up regarding his indulgence in sexual harassment at the work place.       After sometime a women employee launched a formal complaint to the management against the marketing executive about sexually harassing her. Faced with the companies’ indifference, in not taking cognizance of her grievances, she lodged an FIR with police.       Realizing the sensitivity and gravity of the situation, the company called the women employee to negotiate. In that she was offered a hefty sum of money to withdraw the complaint and the FIR and also give in writing that the marketing executive is not involved in the case.      Identify the ethical issues involved in this case. What options are available to the women employee? (250 words) (20 marks)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics ",
                "case studies\n"
            ]
        },
        "child70": {
            "question": "Q. In a modern democratic polity there is a concept of political executive and permanent executive elected people’s representatives forms the political executive and bureaucracy forms the permanent executive. Ministers frame policy decisions and bureaucrats execute these. In the initial decades after independence, relationship between the permanent executives and the political executives were characterized by mutual understanding, respect, and cooperation, without encroaching upon each other’s domain.       However, in the subsequent decades the situation has changed. There are instances of the political executive insisting upon the permanent executives to follow its agenda. Respect for an appreciation of an upright bureaucrats has declined. There is an increasing tendency among the political executive to get involved in routine administrative matters such as transfers, posting etc. Under this scenario, there is a definitive trend towards ‘politicization of bureaucracy’. The raising materialism and acquisitiveness in social life has also adversely impacted upon the ethical values of both the permanent executive and the political executive.     What are the consequences of this ‘politicization of bureaucracy? Discuss.  (250 words) (20 marks) ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics ",
                "case studies\n"
            ]
        },
        "child71": {
            "question": "Q. In one of the districts of a frontier state, narcotics menace has been rampant. This has results in money laundering, mushrooming of poppy farming, arms smuggling and near stalling of education. The system is on the verge of collapse. The situation has been further worsened by unconfirmed reports that local politicians as well as some senior police officers are providing surreptitious patronage to the drug mafia. At that point of time a woman police officer, known for her skills in handling such situations is appointed as superintendent of police to bring the situation to normalcy.      If you are the same police officer, identify the various dimensions of the crisis. Based on your understanding, suggest measures to deal with the crisis. (250 words) (20 marks)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics ",
                "case studies\n"
            ]
        },
        "child72": {
            "question": "Q. In recent times, there has been an increasing concern in India to develop effective civil service ethics, code of conduct, transparency measures, ethics and integrity systems and anti-corruption agencies. In view of this, there is need being felt to focus on three specific areas, which are directly relevant to the problems of internalizing integrity and ethics in the civil services. These are as follows:     1. Anticipating specific threats to ethical standards and integrity in the civil services,        2. Strengthening the ethical competence of civil servant and      3. Developing administrative processes and practices which promote ethical values and integrity in civil services.        Suggest institutional measures to address the above three issues. (250 words) (20 marks)  ",
            "tags": [
                "2019",
                "UPSC",
                "gs4 ",
                "ethics ",
                "case studies\n"
            ]
        },
        "child73": {
            "question": "Q. Wisdom finds truth. ",
            "tags": [
                "2019",
                "UPSC",
                "essay\n"
            ]
        },
        "child74": {
            "question": "Q. Values are not what humanity is, but what humanity ought to be.  ",
            "tags": [
                "2019",
                "UPSC",
                "essay\n"
            ]
        },
        "child75": {
            "question": "Q. Best for an individual is not necessarily best for the society.  ",
            "tags": [
                "2019",
                "UPSC",
                "essay\n"
            ]
        },
        "child76": {
            "question": "Q. Courage to accept and dedication to improve are two keys to success.  ",
            "tags": [
                "2019",
                "UPSC",
                "essay\n"
            ]
        },
        "child77": {
            "question": "Q. South Asian Societies are woven not around the state, but around their plural cultures and plural identities.  ",
            "tags": [
                "2019",
                "UPSC",
                "essay\n"
            ]
        },
        "child78": {
            "question": "Q. Neglect of primary healthcare and education in India are reasons for its backwardness.  ",
            "tags": [
                "2019",
                "UPSC",
                "essay\n"
            ]
        },
        "child79": {
            "question": "Q. Biased media is a real threat to Indian Democracy  ",
            "tags": [
                "2019",
                "UPSC",
                "essay\n"
            ]
        },
        "child80": {
            "question": "Q. Rise of Artificial Intelligence: the threat of jobless future or better job opportunities through reskilling and upskilling.  ",
            "tags": [
                "2019",
                "UPSC",
                "essay"
            ]
        }
    }
}