{
    "title": "Agriculture",
    "child": {
        "child1": {
            "question": "Q. do you mean by Minimum Support Price (MSP)? How will MSP rescue the farmers from the low income trap?   ",
            "tags": [
                "Agriculture",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. Examine the role of supermarkets in supply chain management of fruits, vegetables, and food items. How do they eliminate number of intermediaries?",
            "tags": [
                "Agriculture",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. Assess the role of National Horticulture Mission (NHM) in boosting the production, productivity and income of horticulture farms. How far has it succeeded in increasing the income of farmers? ",
            "tags": [
                "Agriculture",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. How has the emphasis on certain crops brought about changes in cropping patterns in recent past? Elaborate the emphasis on millets production and consumption.",
            "tags": [
                "Agriculture",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. Explain various types of revolutions, took place in Agriculture after Independence in India. How these revolutions have helped in poverty alleviation and food security in India?",
            "tags": [
                "Agriculture",
                "2017",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. What are the major reasons for declining rice and wheat yield in the cropping system? How crop diversification is helpful to stabilise the yield of the crops in the system?",
            "tags": [
                "Agriculture",
                "2017",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. How do subsidies affect the cropping pattern, crop diversity and economy of farmers? What is the significance of crop insurance, minimum support price and food processing for small and marginal farmers?",
            "tags": [
                "Agriculture",
                "2017",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. What is water-use efficiency? Describe the role of micro-irrigation in increasing the water-use efficiency.",
            "tags": [
                "Agriculture",
                "2016",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. What is allelopathy? Discuss its role in major cropping systems of irrigated agriculture.",
            "tags": [
                "Agriculture",
                "2016",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. Discuss the role of land reforms in agricultural development Identify the factors that were responsible for the success of land reforms in India.",
            "tags": [
                "Agriculture",
                "2016",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. Given the vulnerability of Indian agriculture to vagaries of nature, discuss the need for crop insurance and bring out the salient features of the Pradhan Mantri Fasal Bima Yojana (PMFBY).",
            "tags": [
                "Agriculture",
                "2016",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. Livestock rearing has a big potential for providing non-farm employment and income in rural areas. Discuss suggesting suitable measures to promote this sector in India.",
            "tags": [
                "Agriculture",
                "2016",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. In view of the declining average size of land holdings in India which has made agriculture non–viable for a majority of farmers, should contract farming and land leasing be promoted in agriculture? Critically evaluate the pros and cons.",
            "tags": [
                "Agriculture",
                "2016",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. There is also a point of view that Agricultural Produce Market Committees (APMCs) set up under the State Acts have not only impeded the development of agriculture but also have been the cause of food inflation in India. Critically examine.",
            "tags": [
                "Agriculture",
                "2014",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. “In the villages itself no form of credit organization will be suitable except the cooperative society.” — All India Rural Credit Survey. Discuss this statement in the background of agricultural finance in India. What constraints and challenges do financial institutions supplying agricultural finance face? How can technology be used to better reach and serve rural clients?",
            "tags": [
                "Agriculture",
                "2014",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. What are the different types of agriculture subsidies given to farmers at the national and at state levels? Critically analyse the agricultural subsidy regime with reference to the distortions created by it.",
            "tags": [
                "Agriculture",
                "2013",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. India needs to strengthen measures to promote the pink revolution in food industry for ensuring better nutrition and health. Critically elucidate the statement.",
            "tags": [
                "Agriculture",
                "2013",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. Establish relationship between land reforms, agriculture productivity and elimination of poverty in the Indian economy. Discuss the difficulties in designing and implementation of agriculture friendly land reforms in India.",
            "tags": [
                "Agriculture",
                "2013",
                "UPSC"
            ]
        }
    }
}