{
    "title": "Economic Development",
    "child": {
        "child1": {
            "question": "Q. to affordable, reliable, sustainable and modern energy is the sine qua non to achieve Sustainable Development Goals (SDGs).” Comment on the progress made in India in this regard. ",
            "tags": [
                "Economic Development",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. Comment on the important changes introduced in respect of the Long Term Capital Gains Tax (LTCGT) and Dividend Distribution Tax (DDT) in the Union Budget for 2018-2019.",
            "tags": [
                "Economic Development",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. How are principles followed by the NITI Aayog different from those followed by erstwhile Planning Commission in India? ",
            "tags": [
                "Economic Development",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. How would the recent phenomena of protectionism and currency manipulations in world trade affect macroeconomic stability of India?",
            "tags": [
                "Economic Development",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. Among several factors for India’s potential growth, savings rate is the most effective one. Do you agree? What are the other factors available for growth potential?",
            "tags": [
                "Economic Development",
                "2017",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. Account for the failure of manufacturing sector in achieving the goal of labour-intensive exports. Suggest measures for more labour-intensive rather than capital-intensive exports.",
            "tags": [
                "Economic Development",
                "2017",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. Examine the development of Airports in India through joint ventures under Public – Private Partnership (PPP) model. What are the challenges faced by the authorities in this regard.",
            "tags": [
                "Economic Development",
                "2017",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. What are the reasons for poor acceptance of cost-effective small processing unit? How the food processing unit will be helpful to uplift the socio-economic status of poor farmers?",
            "tags": [
                "Economic Development",
                "2017",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. One of the intended objectives of Union-Budget 2017-18 is to ‘transform, energize and clean India’. Analyze the measures proposed in the Budget 2017-18 to achieve the objective.",
            "tags": [
                "Economic Development",
                "2017",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. “Industrial growth rate has lagged behind in the overall growth of Gross-Domestic-Product (GDP) in the post-reform period” Give reasons. How far the recent changes in Industrial Policy are capable of increasing the industrial growth rate?",
            "tags": [
                "Economic Development",
                "2017",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. What are the salient features of ‘inclusive growth’? Has India been experiencing such a growth process? Analyse and suggest measures for inclusive growth.",
            "tags": [
                "Economic Development",
                "2017",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. How globalization has led to the reduction of employment in the formal sector of the Indian economy? Is increased informalization detrimental to the development of the country?",
            "tags": [
                "Economic Development",
                "2016",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. Women empowerment in India needs gender budgeting. What are the requirements and status of gender budgeting in the Indian context?",
            "tags": [
                "Economic Development",
                "2016",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. Pradhan Mantri Jan Dhan Yojana (PMJDY) is necessary for bringing unbanked to the institutional finance fold. Do you agree with this for financial inclusion of the poor section of the Indian society? Give arguments to justify your opinion.",
            "tags": [
                "Economic Development",
                "2016",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. What are ‘Smart Cities’? Examine their relevance for urban development in India. Will it increase rural-urban differences? Give arguments for ’Smart Villages’ in the light of PURA and RURBAN Mission.",
            "tags": [
                "Economic Development",
                "2016",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. Justify the need for FDI for the development of the Indian economy. Why there is gap between MoUs signed and actual FDIs? Suggest remedial steps to be taken for increasing actual FDIs in India.",
            "tags": [
                "Economic Development",
                "2016",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. Comment on the challenges for inclusive growth which include careless and useless manpower in the Indian context. Suggest measures to be taken for facing these challenges.",
            "tags": [
                "Economic Development",
                "2016",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. Give an account of the current status and the targets to be achieved pertaining to renewable energy sources in the country. Discuss in brief the importance of National Programme on Light Emitting Diodes (LEDs).",
            "tags": [
                "Economic Development",
                "2016",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. The nature of economic growth in India in recent times is often described as jobless growth. Do you agree with this view? Give arguments in favour of your answer.",
            "tags": [
                "Economic Development",
                "2015",
                "UPSC"
            ]
        },
        "child20": {
            "question": "Q. How can the ‘Digital India’ programme help farmers to improve farm productivity and income? What steps has the Government taken in this regard?",
            "tags": [
                "Economic Development",
                "2015",
                "UPSC"
            ]
        },
        "child21": {
            "question": "Q. In what way could replacement of price subsidy with Direct Benefit Transfer (DBT) change the scenario of subsidies in India? Discuss.",
            "tags": [
                "Economic Development",
                "2015",
                "UPSC"
            ]
        },
        "child22": {
            "question": "Q. What are the impediments in marketing and supply chain management in developing the food processing industry in India? Can e-commerce help in overcoming these bottlenecks?",
            "tags": [
                "Economic Development",
                "2015",
                "UPSC"
            ]
        },
        "child23": {
            "question": "Q. Craze for gold in Indians has led to a surge in import of gold in recent years and put pressure on balance of payments and external value of rupee. In view of this, examine the merits of Gold Monetization Scheme.",
            "tags": [
                "Economic Development",
                "2015",
                "UPSC"
            ]
        },
        "child24": {
            "question": "Q. “Success of ‘Make in India’ programme depends on the success of ‘Skill India’ programme and radical labour reforms.” Discuss with logical arguments.",
            "tags": [
                "Economic Development",
                "2015",
                "UPSC"
            ]
        },
        "child25": {
            "question": "Q. To what factors can the recent dramatic fall in equipment costs and tariff of solar energy be attributed? What implications does the trend have for the thermal power producers and the related industry?",
            "tags": [
                "Economic Development",
                "2015",
                "UPSC"
            ]
        },
        "child26": {
            "question": "Q. There is a clear acknowledgement that Special Economic Zones (SEZs) are a tool of industrial development, manufacturing and exports. Recognising this potential, the whole instrumentality of SEZs require augmentation. Discuss the issues plaguing the success of SEZs with respect to taxation, governing laws and administration.",
            "tags": [
                "Economic Development",
                "2015",
                "UPSC"
            ]
        },
        "child27": {
            "question": "Q. Normally countries shift from agriculture to industry and then later to services, but India shifted directly from agriculture to services. What are the reasons for the huge growth of services vis-à-vis industry in the country? Can India become a developed country without a strong industrial base?",
            "tags": [
                "Economic Development",
                "2014",
                "UPSC"
            ]
        },
        "child28": {
            "question": "Q. “While we flaunt India’s demographic dividend, we ignore the dropping rates of employability.” What are we missing while doing so? Where will the jobs that India desperately needs come from? Explain.",
            "tags": [
                "Economic Development",
                "2014",
                "UPSC"
            ]
        },
        "child29": {
            "question": "Q. The Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Act, 2013 has come into effect from 1st January, 2014. What are the key issues which would get addressed with the Act in place? What implications would it have on industrialization and agriculture in India?",
            "tags": [
                "Economic Development",
                "2014",
                "UPSC"
            ]
        },
        "child30": {
            "question": "Q. Capitalism has guided the world economy to unprecedented prosperity. However, it often encourages short-sightedness and contributes to wide disparities between the rich and the poor. In this light, would it be correct to believe and adopt capitalism for bringing inclusive growth in India? Discuss.",
            "tags": [
                "Economic Development",
                "2014",
                "UPSC"
            ]
        },
        "child31": {
            "question": "Q. Explain how Private Public Partnership arrangements, in long gestation infrastructure projects, can transfer unsustainable liabilities to the future. What arrangements need to be put in place to ensure that successive generations’ capacities are not compromised?",
            "tags": [
                "Economic Development",
                "2014",
                "UPSC"
            ]
        },
        "child32": {
            "question": "Q. National Urban Transport Policy emphasises on ‘moving people’ instead of ‘moving vehicles’. Discuss critically the success of the various strategies of the Government in this regard.",
            "tags": [
                "Economic Development",
                "2014",
                "UPSC"
            ]
        },
        "child33": {
            "question": "Q. Foreign Direct Investment (FDI) in the defence sector is now set to be liberalized. What influence this is expected to have on Indian defence and economy in the short and long run?",
            "tags": [
                "Economic Development",
                "2014",
                "UPSC"
            ]
        },
        "child34": {
            "question": "Q. Should the pursuit of carbon credits and clean development mechanisms set up under UNFCCC-be maintained even though there has been a massive slide in the value of a carbon credit? Discuss with respect to India’s energy needs for economic growth.",
            "tags": [
                "Economic Development",
                "2014",
                "UPSC"
            ]
        },
        "child35": {
            "question": "Q. With a consideration towards the strategy of inclusive growth, the new Companies Bill, 2013 has indirectly made CSR a mandatory obligation. Discuss the challenges expected in its implementation in right earnest. Also discuss other provisions in the Bill and their implications.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        },
        "child36": {
            "question": "Q. What were the reasons for the introduction of Fiscal Responsibility and Budget Management (FRBM) Act, 2003? Discuss critically its salient features and their effectiveness.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        },
        "child37": {
            "question": "Q. What is the meaning of the term ‘tax expenditure’? Taking housing sector as an example, discuss how it influences the budgetary policies of the government.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        },
        "child38": {
            "question": "Q. Food Security Bill is expected to eliminate hunger and malnutrition in India. Critically discuss various apprehensions in its effective implementation along with the concerns it has generated in WTO.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        },
        "child39": {
            "question": "Q. Examine the impact of liberalization on companies owned by Indians. Are they competing with the MNCs satisfactorily? Discuss.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        },
        "child40": {
            "question": "Q. (a) Discuss the impact of FDI entry into Multi-trade retail sector on supply chain management in commodity trade pattern of the economy.\n(b) Though India allowed Foreign Direct Investment (FDI) in what is called multi-brand retail through the joint venture route in September 2012, the FDI, even after a year, has not picked up. Discuss the reasons.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        },
        "child41": {
            "question": "Q. Discuss the rationale for introducing Goods and Services Tax (GST) in India. Bring out critically the reasons for the delay in roll out for its regime.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        },
        "child42": {
            "question": "Q. Write a note on India’s green energy corridor to alleviate the problem of conventional energy.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        },
        "child43": {
            "question": "Q. Adoption of PPP model for infrastructure development of the country has not been free of criticism. Critically discuss pros and cons of the model.",
            "tags": [
                "Economic Development",
                "2013",
                "UPSC"
            ]
        }
    }
}