{
    "title": "Environment and Ecology",
    "child": {
        "child1": {
            "question": "Q. are the impediments disposing the huge quantities of discarded solid waste which are continuously being generated? How do we remove safely the toxic wastes that have been accumulated in our habitable environment?            ",
            "tags": [
                "Environment and Ecology",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. What is wetland? Explain the Ramsar concept of ‘wise use’ in the context of wetland conservation. Cite two examples of Ramsar sites from India. ",
            "tags": [
                "Environment and Ecology",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. Sikkim is the first ‘Organic State’ in India. What are the ecological and economical benefits of Organic State? ",
            "tags": [
                "Environment and Ecology",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. How does biodiversity vary in India? How is the Biological Diversity Act, 2002 helpful in conservation of flora and fauna?",
            "tags": [
                "Environment and Ecology",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. Not many years ago, river linking was a concept but it is becoming reality in the country. Discuss the advantages of river linking and its possible impact on the environment.",
            "tags": [
                "Environment and Ecology",
                "2017",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. ‘Climate change’ is a global problem. How India will be affected by climate change? How Himalayan and coastal states of India will be affected by climate change?",
            "tags": [
                "Environment and Ecology",
                "2017",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. Rehabilitation of human settlements is one of the important environmental impacts which always attracts controversy while planning major projects. Discuss the measures suggested for mitigation of this impact while proposing major developmental projects.",
            "tags": [
                "Environment and Ecology",
                "2016",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. Discuss the Namami Gange and National Mission for Clean Ganga (NMCG) programmes and causes of mixed results from the previous schemes. What quantum leaps can help preserve the river Ganga better than incremental inputs?",
            "tags": [
                "Environment and Ecology",
                "2015",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. Environmental Impact Assessment studies are increasingly undertaken before a project is cleared by the Government. Discuss the environmental impacts of coal-fired thermal plants located at coal pitheads.",
            "tags": [
                "Environment and Ecology",
                "2014",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. What are the consequences of Illegal mining? Discuss the Ministry of Environment and Forests’ concept of GO AND NO GO zones for coal mining sector.",
            "tags": [
                "Environment and Ecology",
                "2013",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. Enumerate the National Water Policy of India. Taking river Ganges as an example, discuss the strategies which may be adopted for river water pollution control and management. What are the legal provisions of management and handling of hazardous wastes in India?",
            "tags": [
                "Environment and Ecology",
                "2013",
                "UPSC"
            ]
        }
    }
}