{
    "title": "Ethics",
    "child": {
        "child1": {
            "question": "Q. State the three basic values, universal in nature, in the context of civil services and bring out their importance.\n(b) Distinguish between “Code of ethics” and “Code of conduct” with suitable examples.     ",
            "tags": [
                "Ethics",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. (a) What is meant by public interest? What are the principles and procedures to be followed by civil servants in public interest? \n(b) “The Right to Information Act is not all about citizens’ empowerment alone, it essentially redefines the concept of accountability.” Discuss",
            "tags": [
                "Ethics",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. (a) What is meant by conflict of interest? Illustrate with examples, the difference between the actual and potential conflicts of interest.\n(b) “In looking for people to hire, you look for three qualities: integrity, intelligence and energy. And if they do not have the first, the other two will kill you.” —Warren Buffet\nWhat do you understand by this statement in the present-day scenario? Explain.      ",
            "tags": [
                "Ethics",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. (a) “In doing a good thing, everything is permitted which is not prohibited expressly or by clear implication.” Examine the statement with suitable examples in the context of a public servant discharging his/her duties.\n(b) With regard to morality of actions, one view is that means are of paramount importance and the other view is that the ends justify the means. Which view do you think is more appropriate? Justify your answer. ",
            "tags": [
                "Ethics",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. (a) Suppose the Government of India is thinking of constructing a dam in a mountain valley bound by forests and inhabited by ethnic communities. What rational policy should it resort to in dealing with unforeseen contingencies? \n(b) Explain the process of resolving ethical dilemmas in Public Administration.",
            "tags": [
                "Ethics",
                "2018",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. do each of the following quotations means to you in the present context?\n(a) “The true rule, in determining to embrace, or reject any thing, is not whether it has any evil in it; but whether it has more evil than good. There are few things wholly evil or wholly good. Almost every thing, especially of government policy, is an inseparable compound of the two; so that our best judgment of the preponderance between them is continually demanded.” – Abraham Lincoln.  \n(b) “Anger and intolerance are the enemies of correct understanding.” – Mahatma Gandhi.  \n(c) “Falsehood takes the place of truth when it results in unblemished common good.” – Tirukkural",
            "tags": [
                "Ethics",
                "2018",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. Conflict of interest in the public sector arises when\n(a) official duties,\n(b) public interest, and\n(c) personal interest\nare taking priority one above the other.\nHow can this conflict in administration be resolved? Describe with an example.",
            "tags": [
                "Ethics",
                "2017",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. Examine the relevance of the following in the context of civil service:\n(a) Transparency\n(b) Accountability\n(c) Fairness and Justice\n(d) Courage of Conviction\n(e) Spirit of service",
            "tags": [
                "Ethics",
                "2017",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. Young people with ethical conduct are not willing to come forward to join active politics. Suggest steps to motivate them to come forward.",
            "tags": [
                "Ethics",
                "2017",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. (a) One of the tests of integrity is complete refusal to be compromised. Explain with reference to a real life example.\n(b) Corporate social responsibility makes companies more profitable and sustainable. Analyse.",
            "tags": [
                "Ethics",
                "2017",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. (a) “Great ambition is the passion of a great character. Those endowed with it may perform very good or very bad acts. All depends on the principles which direct them.” – Napoleon Bonaparte.\nStating examples mention the rulers (i) who have harmed society and country, (ii) who worked for the development of society and country.\n(b) “If a country is to be corruption free and become a nation of beautiful minds, I strongly feel there are three key societal members who can make a difference. They are the father, the mother and the teacher.” – A.P.J. Abdul Kalam. Analyse.",
            "tags": [
                "Ethics",
                "2017",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. (a) How will you apply emotional intelligence in administrative practices?\n(b) Strength, peace and security are considered to be the pillars of international relations. Elucidate.",
            "tags": [
                "Ethics",
                "2017",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. (a) The crisis of ethical values in modern times is traced to a narrow perception of the good life. Discuss.\n(b) Increased national wealth did not result in equitable distribution of its benefits. It has created only some “enclaves of modernity and prosperity for a small minority at the cost of the majority.” Justify.",
            "tags": [
                "Ethics",
                "2017",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. (a) Discipline generally implies following the order and subordination. However, it may be counter-productive for the organisation. Discuss.\n(b) Without commonly shared and widely entrenched moral values and obligations, neither the law, nor democratic government, nor even the market economy will function properly.\nWhat do you understand by this statement? Explain with illustration in the contemporary times.",
            "tags": [
                "Ethics",
                "2017",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. (a) Explain how ethics contributes to social and human well-being.\n(b) Why should impartiality and non-partisanship be considered as foundational values in public services, especially in the present day socio-political context? Illustrate your answer with examples.",
            "tags": [
                "Ethics",
                "2016",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. (a) What do you understand by the terms ‘governance’, ‘good governance’ and ‘ethical governance’?\n(b) Discuss Mahatma Gandhi’s Concept of seven sin.",
            "tags": [
                "Ethics",
                "2016",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. (a) Analyse John Rawls’s concept of social justice in the Indian context.\n(b) Discuss the Public Services Code as recommended by the 2nd Administrative Reforms Commission.",
            "tags": [
                "Ethics",
                "2016",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. (a) “Corruption causes misuse of government treasury, administrative inefficiency and obstruction in the path of national development.” Discuss Kautilya’s views.\n(b) How could social influence and persuasion contribute to the success of Swachh Bharat Abhiyan?",
            "tags": [
                "Ethics",
                "2016",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. Law and Ethics are considered to be the two tools for controlling human conduct so as to make it conducive to civilized social existence.\n(a) Discuss how they achieve this objective.\n(b) Discuss how they achieve this objective.",
            "tags": [
                "Ethics",
                "2016",
                "UPSC"
            ]
        },
        "child20": {
            "question": "Q. Our attitudes towards life, work, other people and society are generally shaped unconsciously by the family and the social surroundings in which we grow up. Some of these unconsciously acquired attitudes and values are often undesirable in the citizens of a modern democratic and egalitarian society.\n(a) Discuss such undesirable values prevalent in today's educated Indians.\n(b) How can such undesirable attitudes be changed and socioethical values considered necessary in public services be cultivated in the aspiring and serving civil servants?",
            "tags": [
                "Ethics",
                "2016",
                "UPSC"
            ]
        },
        "child21": {
            "question": "Q. Anger is a harmful negative emotion. It is injurious to both personal life and work life.\n(a) Discuss how it leads to negative emotions and undesirable behaviours.\n(b) How can it be managed and controlled?",
            "tags": [
                "Ethics",
                "2016",
                "UPSC"
            ]
        },
        "child22": {
            "question": "Q. “Max Weber said that it is not wise to apply to public administration the sort of moral and ethical norms we apply to matters of personal conscience. It is important to realize that the state bureaucracy might possess its own independent bureaucratic morality.” Critically analyse this statement.",
            "tags": [
                "Ethics",
                "2016",
                "UPSC"
            ]
        },
        "child23": {
            "question": "Q. (a) What is meant by ‘environmental ethics’? Why is it important to study? Discuss any one environmental issue from the viewpoint of environmental ethics.\n(b) Differentiate between the following:\nLaw and Ethics\nEthical management and Management of ethics\nDiscrimination and Preferential treatment\nPersonal ethics and Professional ethics",
            "tags": [
                "Ethics",
                "2015",
                "UPSC"
            ]
        },
        "child24": {
            "question": "Q. Given are two quotations of moral thinkers/philosophers. For each of these, bring out what it means to you in the present context:\n(a) “The weak can never forgive; forgiveness is the attribute of the strong.”\n(b) “We can easily forgive a child who is afraid of the dark; the real tragedy of life is when men are afraid of the light.”",
            "tags": [
                "Ethics",
                "2015",
                "UPSC"
            ]
        },
        "child25": {
            "question": "Q. (a) “A mere compliance with law is not enough, the public servant also has to have a well-developed sensibility to ethical issues for effective discharge of duties.” Do you agree? Explain with the help of two examples, where (i) an act is ethically right, but not legally and (ii) an act is legally right, but not ethically.\n(b) How do the virtues of trustworthiness and fortitude get manifested in public service? Explain with examples.",
            "tags": [
                "Ethics",
                "2015",
                "UPSC"
            ]
        },
        "child26": {
            "question": "Q. (a) “Social values are more important than economic values.” Discuss the above statement with examples in the context of inclusive growth of a nation.\n(b) Some recent developments such as introduction of RTI Act, media and judicial activism, etc., are proving helpful in bringing about greater transparency and accountability in the functioning of the government. However, it is also being observed that at times the mechanisms are misused. Another negative effect is that the officers are now afraid to take prompt decisions. Analyze this situation in detail and suggest how this dichotomy can be resolved. Suggest how these negative impacts can be minimized.",
            "tags": [
                "Ethics",
                "2015",
                "UPSC"
            ]
        },
        "child27": {
            "question": "Q. Two different kinds of attitudes exhibited by public servants towards their work have been identified as the bureaucratic attitude and the democratic attitude.\n(a) Distinguish between these two terms and write their merits and demerits,\n(b) Is it possible to balance the two to create a better administration for the faster development of our country?",
            "tags": [
                "Ethics",
                "2015",
                "UPSC"
            ]
        },
        "child28": {
            "question": "Q. Today we find that in spite of various measures like prescribing codes of conduct, setting up vigilence cells/commissions, RTI, active media and strengthening of legal mechanisms, corrupt practices are not coming under control.\n(a) Evaluate the effectiveness of these measures with justifications.\n(b) Suggest more effective strategies to tackle this menace.",
            "tags": [
                "Ethics",
                "2015",
                "UPSC"
            ]
        },
        "child29": {
            "question": "Q. At the international level, the bilateral relations between most nations are governed on the policy of promoting one’s own national interest without any regard for the interest of other nations. This leads to conflicts and tensions between the nations. How can ethical consideration help resolve such tensions? Discuss with specific examples.",
            "tags": [
                "Ethics",
                "2015",
                "UPSC"
            ]
        },
        "child30": {
            "question": "Q. Public servants are likely to confront with the issues of ‘Conflict of Interest’. What do you understand by the term ‘Conflict of Interest’ and how does it manifest in the decision making by public servants? If faced with the conflict of interest situation, how would you resolve it? Explain with the help of examples.",
            "tags": [
                "Ethics",
                "2015",
                "UPSC"
            ]
        },
        "child31": {
            "question": "Q. with examples. 31. (a) All human beings aspire for happiness. Do you agree? What does happiness mean to you? Explain with examples. \n(b) What does ethics seek to promote in human life? Why is it all the more important in public administration?",
            "tags": [
                "Ethics",
                "2014",
                "UPSC"
            ]
        },
        "child32": {
            "question": "Q. (a) In the context of defence services, 'patriotism' demands readiness to even lay down one's life in protecting the nation. According to you, what does patriotism imply in everyday civil life? Explain with illustrations and justify your answer.\n(b). What do you understand by 'probity' in public life? What are the difficulties in practicing it in the present times? How can these difficulties be overcome?",
            "tags": [
                "Ethics",
                "2014",
                "UPSC"
            ]
        },
        "child33": {
            "question": "Q. (a) \"Integrity without knowledge is weak and useless, but knowledge without integrity is dangerous and dreadful.\" What do you understand by this statement? Explain your stand with illustrations from the modern context.\n(b). \"Human beings should always be treated as 'ends' in themselves and never as merely `means'.\" Explain the meaning and significance of this statement, giving its implications in the modern techno-economic society.",
            "tags": [
                "Ethics",
                "2014",
                "UPSC"
            ]
        },
        "child34": {
            "question": "Q. (a) Which eminent personality has inspired you the most in the context of ethical conduct in life? Give the gist of his/her teachings. Giving specific examples, describe how you have been able to apply these teachings for your own ethical development.\n(b). There is a heavy ethical responsibility on the public servants because they Occupy positions of power, handle huge amounts of public funds, and their decisions have wide-ranging impact on society and environment. What steps have you taken to improve your ethical competence to handle such responsibility?",
            "tags": [
                "Ethics",
                "2014",
                "UPSC"
            ]
        },
        "child35": {
            "question": "Q. (a) The current society is plagued with widespread trust-deficit. What are the consequences of this situation for personal well-being and for societal well-being? What can you do at the personal level to make yourself trustworthy?\n(b). It is often said that poverty leads to corruption. However, there is no dearth of instances where affluent and powerful people indulge in corruption in a big way. What are the basic causes of corruption among people? Support your answer with examples.",
            "tags": [
                "Ethics",
                "2014",
                "UPSC"
            ]
        },
        "child36": {
            "question": "Q. What factors affect the formation of a person's attitude towards social problems? In our society, contrasting attitudes are prevalent about many social problems. What contrasting attitudes do you notice about the caste system in our society? How do you explain the existence of these contrasting attitudes?",
            "tags": [
                "Ethics",
                "2014",
                "UPSC"
            ]
        },
        "child37": {
            "question": "Q. What does 'accountability' mean in the context of public service? What measures can be adopted to ensure individual and collective accountability of public servants?",
            "tags": [
                "Ethics",
                "2014",
                "UPSC"
            ]
        },
        "child38": {
            "question": "Q. We are witnessing increasing instances of sexual violence against women in the country. Despite existing legal provisions against it, the number of such incidences is on the rise. Suggest some innovative measures to tackle this menace.",
            "tags": [
                "Ethics",
                "2014",
                "UPSC"
            ]
        },
        "child39": {
            "question": "Q. What do you understand by ‘Values’ and ‘Ethics’? In what way is it important to be ethical along with being professionally competent?",
            "tags": [
                "Ethics",
                "2013",
                "UPSC"
            ]
        },
        "child40": {
            "question": "Q. (a) What do you understand by the following terms in the context of public service?\nIntegrity\nPerseverance\nSpirit of Service\nCommitment\nCourage of Conviction\n(b) Indicate two more attributes which you consider important for public service. Justify your answer.",
            "tags": [
                "Ethics",
                "2013",
                "UPSC"
            ]
        },
        "child41": {
            "question": "Q. Some people feel that values keep changing with time and situation, while others strongly believe that there are certain universal and eternal human values. Give your perception in this regard with due justification.",
            "tags": [
                "Ethics",
                "2013",
                "UPSC"
            ]
        },
        "child42": {
            "question": "Q. What is ‘emotional intelligence’ and how can it be developed in people? How does it help an individual in taking ethical decisions?",
            "tags": [
                "Ethics",
                "2013",
                "UPSC"
            ]
        },
        "child43": {
            "question": "Q. (a) What do you understand by the term ‘voice of conscience’? How do you prepare yourself to heed to the voice of conscience?\n(b) What is meant by ‘crisis of conscience’? Narrate one incident in your life when you were faced with such a crisis and how you resolved the same.",
            "tags": [
                "Ethics",
                "2013",
                "UPSC"
            ]
        },
        "child44": {
            "question": "Q. Given below are three quotations of great moral thinkers/philosophers. For each of these quotations, bring out what it means to you in the present context:\n(a) “There is enough on this earth for every one’s need but for no one’s greed.” -Mahatma Gandhi\n(b) “Nearly all men can withstand adversity, but if you want to test a man’s character, give him power.” - Abraham Lincoln.\n(c) “I count him braver who overcomes his desires than him who overcomes his enemies.” - Aristotle",
            "tags": [
                "Ethics",
                "2013",
                "UPSC"
            ]
        },
        "child45": {
            "question": "Q. “The good of an individual is contained in the good of all.” what do you understand by this statement? How can this principle be implemented in public life?",
            "tags": [
                "Ethics",
                "2013",
                "UPSC"
            ]
        },
        "child46": {
            "question": "Q. It is often said that ‘politics’ and ‘ethics do not go together. What is your opinion in this regard? Justify your answer with illustration.",
            "tags": [
                "Ethics",
                "2013",
                "UPSC"
            ]
        },
        "child47": {
            "question": "Q. In civilized life, law floats in a sea of ethics’. Elucidate.",
            "tags": [
                "Ethics",
                "Insight"
            ]
        },
        "child48": {
            "question": "Q. Differentiate between ethics in private and public relationships",
            "tags": [
                "Ethics",
                "Insight"
            ]
        },
        "child49": {
            "question": "Q. Educational institutions are adept at reinforcing regressive values rather than inculcating new progressive ones. Evaluate.",
            "tags": [
                "Ethics",
                "Insight"
            ]
        },
        "child50": {
            "question": "Q. International relations can be narrowed down to advocacy of the self-interest of nations. In this context, can international relations be seen as relations between global powers, with other nations following?",
            "tags": [
                "Ethics",
                "Insight"
            ]
        },
        "child51": {
            "question": "Q. Conflict of interest is at the root of ethical issues and dilemmas in public administration. Elucidate with an example.",
            "tags": [
                "Ethics",
                "Insight"
            ]
        }
    }
}