{
    "title": "Geography",
    "child": {
        "child1": {
            "question": "Q. Why is Indian Regional Navigational Satellite System (IRNSS) needed? How does it help in navigation?",
            "tags": [
                "Geography",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. Why is India taking keen interest in resources of Arctic region?",
            "tags": [
                "Geography",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. Define mantle plume and explain its role in plate tectonics. ",
            "tags": [
                "Geography",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. What are the consequences of spreading of ‘Dead Zones’ on marine ecosystems?",
            "tags": [
                "Geography",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. “The ideal solution of depleting ground water resources in India is water harvesting system”. How can it be made effective in urban areas? ",
            "tags": [
                "Geography",
                "2018",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. Defining blue revolution, explain the problems and strategies for pisciculture development in India. ",
            "tags": [
                "Geography",
                "2018",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. What is the significance of Industrial Corridors in India? Identifying industrial corridors, explain their main characteristics. ",
            "tags": [
                "Geography",
                "2018",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. Mention core strategies for the transformation of aspirational districts in India & explain the nature of convergence, collaboration & Competition for its success.",
            "tags": [
                "Geography",
                "2018",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. How does the Juno Mission of NASA help to understand the origin and evolution of the Earth?",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. “In spite of adverse environmental impact, coal mining is still inevitable for development”. Discuss.",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. Mention the advantages of the cultivation of pulses because of which the year 2016 was declared as the International Year of Pulses by United Nations.",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. How does the cryosphere affect global climate?",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. “The growth of cities as I.T. hubs has opened up new avenues of employment, but has also created new problems”. Substantiate this statement with examples.",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. Account for variations in oceanic salinity and discuss its multidimensional effects.",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. Petroleum refineries are not necessarily located nearer to crude oil producing areas, particularly in many of the developing countries. Explain its implications.",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. In what way can floods be converted into a sustainable source of irrigation and all-weather inland navigation in India?",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. What characteristics can be assigned to monsoon climate that succeeds in feeding more than 50 percent of the world population residing in Monsoon Asia?",
            "tags": [
                "Geography",
                "2017",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. With a brief background of quality of urban life in India, introduce the objectives and strategy of the ‘Smart City Programme.’",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. Discuss the concept of air mass and explain its role in macro-climatic changes.",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child20": {
            "question": "Q. “The Himalayas are highly prone to landslides.” Discuss the causes and suggest suitable measures of mitigation.",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child21": {
            "question": "Q. The effective management of land and water resources will drastically reduce the human miseries. Explain.",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child22": {
            "question": "Q. South China Sea has assumed great geopolitical significance in the present context. Comment.",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child23": {
            "question": "Q. Major cities of India are becoming vulnerable to flood conditions. Discuss.",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child24": {
            "question": "Q. Present an account of the Indus Water Treaty and examine its ecological, economic and political implications in the context of changing bilateral relations.",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child25": {
            "question": "Q. Enumerate the problems and prospects of inland water transport in India.",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child26": {
            "question": "Q. In what way micro-watershed development projects help in water conservation in drought-prone and semi-arid regions of India?",
            "tags": [
                "Geography",
                "2016",
                "UPSC"
            ]
        },
        "child27": {
            "question": "Q. Explain the factors responsible for the origin of ocean currents? How do they influence regional climates, fishing and navigation?",
            "tags": [
                "Geography",
                "2015",
                "UPSC"
            ]
        },
        "child28": {
            "question": "Q. Mumbai, Delhi and Kolkata are the three mega cities of the country but the air pollution is much more serious problem in Delhi as compared to the other two. Why is this so?",
            "tags": [
                "Geography",
                "2015",
                "UPSC"
            ]
        },
        "child29": {
            "question": "Q. India is well endowed with fresh water resources. Critically examine why it still suffers from water scarcity.",
            "tags": [
                "Geography",
                "2015",
                "UPSC"
            ]
        },
        "child30": {
            "question": "Q. The states of Jammu and Kashmir, Himachal Pradesh and Uttarakhand are reaching the limits of their ecological carrying capacity due to tourism. Critically evaluate.",
            "tags": [
                "Geography",
                "2015",
                "UPSC"
            ]
        },
        "child31": {
            "question": "Q. How far do you agree that the behaviour of the Indian monsoon has been changing due to humanizing landscapes? Discuss.",
            "tags": [
                "Geography",
                "2015",
                "UPSC"
            ]
        },
        "child32": {
            "question": "Q. Smart cities in India cannot sustain without smart villages. Discuss this statement in the backdrop of rural urban integration.",
            "tags": [
                "Geography",
                "2015",
                "UPSC"
            ]
        },
        "child33": {
            "question": "Q. What are the economic significances of discovery of oil in Arctic Sea and its possible environmental consequences?",
            "tags": [
                "Geography",
                "2015",
                "UPSC"
            ]
        },
        "child34": {
            "question": "Q. Most of the unusual climatic happenings are explained as an outcome of the El-Nino effect. Do you agree?",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child35": {
            "question": "Q. Why are the world’s fold mountain systems located along the margins of continents? Bring out the association between the global distribution of fold mountains and the earthquakes and volcanoes.",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child36": {
            "question": "Q. Explain the formation of thousands of islands in Indonesian and Philippines archipelagos.",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child37": {
            "question": "Q. Tropical cyclones are largely confined to South China Sea, Bay of Bengal and Gulf of Mexico. Why?",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child38": {
            "question": "Q. Bring out the relationship between the shrinking Himalayan glaciers and the symptoms of climate change in the Indian sub-continent.",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child39": {
            "question": "Q. Whereas the British planters had developed tea gardens all along the Shivaliks and Lesser Himalayas from Assam to Himachal Pradesh, in effect they did not succeed beyond the Darjeeling area. Explain.",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child40": {
            "question": "Q. Why did the Green Revolution in India virtually by-pass the eastern region despite fertile soil and good availability of water?",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child41": {
            "question": "Q. Account for the change in the spatial pattern of the Iron and Steel industry in the world.",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child42": {
            "question": "Q. Critically evaluate the various resources of the oceans which can be harnessed to meet the resource crisis in the world.",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child43": {
            "question": "Q. How does India see its place in the economic space of rising natural resource rich Africa?",
            "tags": [
                "Geography",
                "2014",
                "UPSC"
            ]
        },
        "child44": {
            "question": "Q. (a) What do you understand by the theory of ‘continental drift’? Discuss t he prominent evidences in its support. (b) The recent cyclone on east coast of India was called ‘Phailin’. How are the tropical cyclones named across the world? Elaborate.",
            "tags": [
                "Geography",
                "2013",
                "UPSC"
            ]
        },
        "child45": {
            "question": "Q. (a) Bring out the causes for the formation of heat islands in the urban habitat of the world. (b) What do you understand by the phenomenon of ‘temperature inversion’ in meteorology? How does it affect weather and the habitants of the place?",
            "tags": [
                "Geography",
                "2013",
                "UPSC"
            ]
        },
        "child46": {
            "question": "Q. Major hot deserts in northern hemisphere are located between 20-30 deg N latitudes and on the western side of the continents. Why?",
            "tags": [
                "Geography",
                "2013",
                "UPSC"
            ]
        },
        "child47": {
            "question": "Q. (a) Bring out the causes for more frequent occurrence of landslides in the Himalayas than in the Western Ghats. (b) There is no formation of deltas by rivers of the Western Ghats. Why?",
            "tags": [
                "Geography",
                "2013",
                "UPSC"
            ]
        },
        "child48": {
            "question": "Q. (a) Do you agree that there is a growing trend of opening new sugar mills in southern States of India? Discuss with justification. (b) Analyze the factors for the highly decentralized cotton textile industry in India.",
            "tags": [
                "Geography",
                "2013",
                "UPSC"
            ]
        },
        "child49": {
            "question": "Q. With growing scarcity of fossil fuels, the atomic energy is gaining more and more significance in India. Discuss the availability of raw material required for the generation of atomic energy in India and in the world.",
            "tags": [
                "Geography",
                "2013",
                "UPSC"
            ]
        },
        "child50": {
            "question": "Q. It is said that India has substantial reserves of shale oil and gas, which can feed the needs of the country for quarter century. However, tapping of the resource does not appear to be high on the agenda. Discuss critically the availability and issues involved.",
            "tags": [
                "Geography",
                "2013",
                "UPSC"
            ]
        }
    }
}