{
    "title": "Governance",
    "child": {
        "child1": {
            "question": "Q. Contradictions among various competing sectors and stakeholders have resulted in inadequate ‘protection and prevention of degradation’ to environment.” Comment with relevant illustrations.",
            "tags": [
                "Governance",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. E-governance is not only about utilization of the power of new technology, but also much about critical importance of the ‘use value’ of information. Explain. ",
            "tags": [
                "Governance",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. The Citizens’ Charter is an ideal instrument of organizational transparency and accountability, but it has its own limitations. Identify the limitations and suggest measures for greater effectiveness of the Citizens’ Charter.",
            "tags": [
                "Governance",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. Discuss the role of Public Accounts Committee in establishing accountability of the government to the people.",
            "tags": [
                "Governance",
                "2017",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. Is the National Commission for Women able to strategise and tackle the problems that women face at both public and private spheres? Give reasons in support of your answer.",
            "tags": [
                "Governance",
                "2017",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. ‘The emergence of Self Help Groups (SHGs) in contemporary times points to the slow but steady withdrawal of the state from developmental activities’. Examine the role of the SHGs in developmental activities and the measures taken by the Government of India to promote the SHGs.",
            "tags": [
                "Governance",
                "2017",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. “Poverty Alleviation programs in India remain mere showpieces until and unless they are backed up by political will.” Discuss with reference to the performance of the major poverty alleviation program in India.",
            "tags": [
                "Governance",
                "2017",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. Initially Civil Services in India were designed to achieve the goals of neutrality and effectiveness, which seems to be lacking in the present context. Do you agree with the view that drastic reforms are required in Civil Services. Comment.",
            "tags": [
                "Governance",
                "2017",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. “In the Indian governance system, the role of non-state actors has been only marginal.” Critically examine this statement.",
            "tags": [
                "Governance",
                "2016",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. “Demographic Dividend in India will remain only theoretical unless our manpower becomes more educated, aware, skilled and creative.” What measures have been taken by the government to enhance the capacity of our population to be more productive and employable?",
            "tags": [
                "Governance",
                "2016",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. “Effectiveness of the government system at various levels and people’s participation in the governance system are interdependent” Discuss their relationship in the context of India.",
            "tags": [
                "Governance",
                "2016",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. In the integrity index of Transparency International, India stands very low. Discuss briefly the legal, political, social and cultural factors that have caused the decline of public morality in India.",
            "tags": [
                "Governance",
                "2016",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. Has the Indian governmental system responded adequately to the demands of Liberalization, Privatization and Globalization started in 1991? What can the government do to be responsive to this important change?",
            "tags": [
                "Governance",
                "2016",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. “Traditional bureaucratic structure and culture have hampered the process of socio-economic development in India.” Comment.",
            "tags": [
                "Governance",
                "2016",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. Examine critically the recent changes in the rules governing foreign funding of NGOs under the Foreign Contribution (Regulation) Act (FCRA), 1976.",
            "tags": [
                "Governance",
                "2015",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. The Self Help Group (SHG) Bank Linkage Programme (SBLP), which is India’s own innovation , has proved to be one of the most effective poverty alleviation and women empowerment programmes. Elucidate.",
            "tags": [
                "Governance",
                "2015",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. How can the role of NGOs be strengthened in India for development works relating to protection of the environment? Discuss throwing light on the major constraints.",
            "tags": [
                "Governance",
                "2015",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. In the light of Satyam Scandal (2009), discuss the changes brought in corporate governance to ensure transparency, accountability.",
            "tags": [
                "Governance",
                "2015",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. “If amendment bill to the Whistleblowers Protection Act, 2011 tabled in the Parliament is passed, there may be no one left to protect.” Critically evaluate.",
            "tags": [
                "Governance",
                "2015",
                "UPSC"
            ]
        },
        "child20": {
            "question": "Q. “For achieving the desired objectives, it is necessary to ensure that the regulatory institutions remain independent and autonomous.” Discuss in the light of experiences in recent past.",
            "tags": [
                "Governance",
                "2015",
                "UPSC"
            ]
        },
        "child21": {
            "question": "Q. The size of the cabinet should be as big as governmental work justifies and as big as the Prime Minister can manage as a team. How far is the efficacy of a government then inversely related to the size of the cabinet? Discuss.",
            "tags": [
                "Governance",
                "2014",
                "UPSC"
            ]
        },
        "child22": {
            "question": "Q. Though 100 percent FDI is already allowed in non-news media like a trade publication and general entertainment channel, the Government is mulling over the proposal for increased FDI in news media for quite some time. What difference would an increase in FDI make? Critically evaluate the pros and cons.",
            "tags": [
                "Governance",
                "2014",
                "UPSC"
            ]
        },
        "child23": {
            "question": "Q. The setting up of a Rail Tariff Authority to regulate fares will subject the cash strapped Indian Railways to demand subsidy for obligation to operate non-profitable routes and services. Taking into account the experience in the power sector, discuss if the proposed reform is expected to benefit the consumers, the Indian Railways or the private container operators.",
            "tags": [
                "Governance",
                "2014",
                "UPSC"
            ]
        },
        "child24": {
            "question": "Q. The penetration of Self Help Groups (SHGs) in rural areas in promoting participation in development programmes is facing socio-cultural hurdles. Examine.",
            "tags": [
                "Governance",
                "2014",
                "UPSC"
            ]
        },
        "child25": {
            "question": "Q. An athlete participates in Olympics for personal triumph and nation’s glory; victors are showered with cash incentives by various agencies, on their return. Discuss the merit of state sponsored talent hunt and its cultivation as against the rationale of a reward mechanism as encouragement.",
            "tags": [
                "Governance",
                "2014",
                "UPSC"
            ]
        },
        "child26": {
            "question": "Q. Should the premier institutes like IITs/IIMs be allowed to retain premier status, allowed more academic independence in designing courses and also decide mode/criteria of selection of students. Discuss in light of the growing challenges.",
            "tags": [
                "Governance",
                "2014",
                "UPSC"
            ]
        },
        "child27": {
            "question": "Q. Has the Cadre based Civil Services Organization been the cause of slow change in India ? Critically examine.",
            "tags": [
                "Governance",
                "2014",
                "UPSC"
            ]
        },
        "child28": {
            "question": "Q. Two parallel run schemes of the Government, viz. the Adhaar Card and NPR, one as voluntary and the other as compulsory, have led to debates at national levels and also litigations. On merits, discuss whether or not both schemes need run concurrently. Analyse the potential of the schemes to achieve developmental benefits and equitable growth.",
            "tags": [
                "Governance",
                "2014",
                "UPSC"
            ]
        },
        "child29": {
            "question": "Q. Many State Governments further bifurcate geographical administrative areas like Districts and Talukas for better governance. In light of the above, can it also be justified that more number of smaller States would bring in effective governance at State level? Discuss.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        },
        "child30": {
            "question": "Q. Discuss the recommendations of the 13th Finance Commission which have been a departure from the previous commissions for strengthening the local government finances.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        },
        "child31": {
            "question": "Q. The product diversification of financial institutions and insurance companies, resulting in overlapping of products and services strengthens the case for the merger of the two regulatory agencies namely SEBI and IRDA. Justify.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        },
        "child32": {
            "question": "Q. The legitimacy and accountability of Self Help Groups (SHGs) and their patrons, the micro-finance outfits, need systematic assessment and scrutiny for the sustained success of the concept. Discuss.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        },
        "child33": {
            "question": "Q. The Central Government frequently complains on the poor performance of the State Governments in eradicating suffering of the vulnerable sections of the society. Restructuring of Centrally sponsored schemes across the sectors for ameliorating the cause of vulnerable sections of population aims at providing flexibility to the States in better implementation. Critically evaluate.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        },
        "child34": {
            "question": "Q. Electronic cash transfer system for the welfare schemes is an ambitious project to minimize corruption, eliminate wastage and facilitate reforms. Comment.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        },
        "child35": {
            "question": "Q. The basis of providing urban amenities in rural areas (PURA) is rooted in establishing connectivity. Comment.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        },
        "child36": {
            "question": "Q. Though Citizens’ charters have been formulated by many public service delivery organizations, there is no corresponding improvement in the level of citizens’ satisfaction and quality of services being provided. Analyse.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        },
        "child37": {
            "question": "Q. ‘A national Lokpal, however strong it may be, cannot resolve the problems of immorality in public affairs.’ Discuss.",
            "tags": [
                "Governance",
                "2013",
                "UPSC"
            ]
        }
    }
}