{
    "title": "Indian Society",
    "child": {
        "child1": {
            "question": "Q. “Caste system is assuming new identities and associational forms. Hence caste system cannot be eradicated in India.” Comment.",
            "tags": [
                "Indian Society",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. ‘Despite implementation of various programmes for eradication of poverty by the government in India, poverty is still existing’. Explain by giving reasons.",
            "tags": [
                "Indian Society",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. How the Indian concept of secularism is different from the western model of secularism? Discuss.",
            "tags": [
                "Indian Society",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. ‘Women’s movement in India has not addressed the issues of women of lower social strata.’ Substantiate your view.",
            "tags": [
                "Indian Society",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. ‘Globalization is generally said to promote cultural homogenization but due to this cultural specificities appear to be strengthened in the Indian Society.’ Elucidate.",
            "tags": [
                "Indian Society",
                "2018",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. ‘Communalism arises either due to power struggle or relative deprivation’. Argue by giving suitable illustrations. ",
            "tags": [
                "Indian Society",
                "2018",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. In the context of the diversity of India, can it be said that the regions form cultural units rather than the States? Give reasons with examples for your viewpoint.",
            "tags": [
                "Indian Society",
                "2017",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. What are the two major legal initiatives by the State since Independence addressing discrimination against Scheduled Tribes (STs)?",
            "tags": [
                "Indian Society",
                "2017",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. The spirit of tolerance and love is not only an interesting feature of Indian society from very early times, but it is also playing an important part at the present. Elaborate.",
            "tags": [
                "Indian Society",
                "2017",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. Distinguish between religiousness/religiosity and communalism giving one example of how the former has got transformed into the latter in independent India.",
            "tags": [
                "Indian Society",
                "2017",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. To what extent globalisation has influenced the core of cultural diversity in India? Explain.",
            "tags": [
                "Indian Society",
                "2016",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. “An essential condition to eradicate poverty is to liberate the poor from the process of deprivation.” Substantiate this statement with suitable examples.",
            "tags": [
                "Indian Society",
                "2016",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. Why are the tribals in India referred to as ‘the Scheduled Tribes’? Indicate the major provisions enshrined in the Constitution of India for their upliftment.",
            "tags": [
                "Indian Society",
                "2016",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. What is the basis of regionalism? Is it that unequal distribution of benefits of development on regional basis eventually promotes regionalism? Substantiate your answer.",
            "tags": [
                "Indian Society",
                "2016",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. Describe any four cultural elements of diversity in India and rate their relative significance in building a national identity.",
            "tags": [
                "Indian Society",
                "2015",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. Critically examine whether growing population is the cause of poverty OR poverty is the main cause of population increase in India.",
            "tags": [
                "Indian Society",
                "2015",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. How do you explain the statistics that show that the sex ratio in Tribes in India is more favourable to women than the sex ratio among Scheduled Castes?",
            "tags": [
                "Indian Society",
                "2015",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. Discuss the changes in the trends of labour migration within and outside India in the last four decades.",
            "tags": [
                "Indian Society",
                "2015",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. Discuss the positive and negative effects of globalization on women in India.",
            "tags": [
                "Indian Society",
                "2015",
                "UPSC"
            ]
        },
        "child20": {
            "question": "Q. Debate the issue of whether and how contemporary movements for assertion of Dalit identity work towards annihilation of caste.",
            "tags": [
                "Indian Society",
                "2015",
                "UPSC"
            ]
        },
        "child21": {
            "question": "Q. How does patriarchy impact the position of a middle class working woman in India?",
            "tags": [
                "Indian Society",
                "2014",
                "UPSC"
            ]
        },
        "child22": {
            "question": "Q. Why do some of the most prosperous regions of India have an adverse sex ratio for women? Give your arguments.",
            "tags": [
                "Indian Society",
                "2014",
                "UPSC"
            ]
        },
        "child23": {
            "question": "Q. The life cycle of a joint family depends on economic factors rather than social values. Discuss.",
            "tags": [
                "Indian Society",
                "2014",
                "UPSC"
            ]
        },
        "child24": {
            "question": "Q. Discuss the various economic and socio-cultural forces that are driving increasing feminization of agriculture in India.",
            "tags": [
                "Indian Society",
                "2014",
                "UPSC"
            ]
        },
        "child25": {
            "question": "Q. How do the Indian debates on secularism differ from the debates in the West?",
            "tags": [
                "Indian Society",
                "2014",
                "UPSC"
            ]
        },
        "child26": {
            "question": "Q. Discuss the various social problems which originated out of the speedy process of urbanization in India.",
            "tags": [
                "Indian Society",
                "2013",
                "UPSC"
            ]
        },
        "child27": {
            "question": "Q. “Male membership needs to be encouraged in order to make women’s organization free from gender bias.” Comment.",
            "tags": [
                "Indian Society",
                "2013",
                "UPSC"
            ]
        },
        "child28": {
            "question": "Q. Critically examine the effect of globalization on the aged population in India.",
            "tags": [
                "Indian Society",
                "2013",
                "UPSC"
            ]
        },
        "child29": {
            "question": "Q. Growing feeling of regionalism is an important factor in generation of demand for a separate State. Discuss.",
            "tags": [
                "Indian Society",
                "2013",
                "UPSC"
            ]
        }
    }
}