{
    "title": "International Relations",
    "child": {
        "child1": {
            "question": "Q. relations with Israel have, of late, acquired a depth and diversity, which cannot be rolled back.” Discuss. ",
            "tags": [
                "International Relations",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. A number of outside powers have entrenched themselves in Central Asia, which is a zone of interest to India. Discuss the implications, in this context, of India’s joining the Ashgabat Agreement, 2018. ",
            "tags": [
                "International Relations",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. What are the key areas of reform if the WTO has to survive in the present context of ‘Trade War’, especially keeping in mind the interest of India? ",
            "tags": [
                "International Relations",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. In what ways would the ongoing U.S-Iran Nuclear Pact Controversy affect the national interest of India? How should India respond to this situation?",
            "tags": [
                "International Relations",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. ‘China is using its economic relations and positive trade surplus as tools to develop potential military power status in Asia’. In the light of this statement, discuss its impact on India as her neighbour.",
            "tags": [
                "International Relations",
                "2017",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. What are the main functions of the United Nations Economic and Social Council (ECOSOC)? Explain different functional commissions attached to it.",
            "tags": [
                "International Relations",
                "2017",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. The question of India’s Energy Security Constitutes the most important part of India’s economic progress. Analyse India’s energy policy cooperation with West Asian countries.",
            "tags": [
                "International Relations",
                "2017",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. Indian Diaspora has an important role to play in South East Asian countries economy and society. Appraise the role of Indian Diaspora in South-East Asia in this context.",
            "tags": [
                "International Relations",
                "2017",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. “The broader aims and objectives of WTO are to manage and promote international trade in the era of globalization. But the Doha round of negotiations seem doomed due to differences between the developed and the developing countries.” Discuss in the Indian perspective.",
            "tags": [
                "International Relations",
                "2016",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. Evaluate the economic and strategic dimensions of India’s Look East Policy in the context of the post Cold War international scenario.",
            "tags": [
                "International Relations",
                "2016",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. \"Increasing crossborder terrorist attacks in India and growing interference in the internal affairs of several memberstates by Pakistan are not conducive for the future of SAARC (South Asian Association for Regional Cooperation).\" Explain with suitable examples.",
            "tags": [
                "International Relations",
                "2016",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. What are the aims and objectives of the McBride Commission of the UNESCO? What is India’s position on these?",
            "tags": [
                "International Relations",
                "2016",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. Increasing interest of India in Africa has its pro and cons. Critically examine.",
            "tags": [
                "International Relations",
                "2015",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. Discuss the impediments India is facing in its pursuit of a permanent seat in UN Security Council.",
            "tags": [
                "International Relations",
                "2015",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. Project ‘Mausam’ is considered a unique foreign policy initiative of Indian Government to improve relationship with its neighbours. Does the project have a strategic dimension? Discuss.",
            "tags": [
                "International Relations",
                "2015",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. Terrorist activities and mutual distrust have clouded India – Pakistan relations. To what extent the use of soft power like sports and cultural exchanges could help generate goodwill between the two countries? Discuss with suitable examples.",
            "tags": [
                "International Relations",
                "2015",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. With respect to the South China sea, maritime territorial disputes and rising tension affirm the need for safeguarding maritime security to ensure freedom of navigation and over flight throughout the region. In this context, discuss the bilateral issues between India and China.",
            "tags": [
                "International Relations",
                "2014",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. The aim of Information Technology Agreements (ITAs) is to lower all taxes and tariffs on information technology products by signatories to zero. What impact would such agreements have on India’s interests?",
            "tags": [
                "International Relations",
                "2014",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. Some of the International funding agencies have special terms for economic participation stipulating a substantial component of the aid to be used for sourcing equipment from the leading countries. Discuss on merits of such terms and if, there exists a strong case not to accept such conditions in the Indian context.",
            "tags": [
                "International Relations",
                "2014",
                "UPSC"
            ]
        },
        "child20": {
            "question": "Q. India has recently signed to become founding member of New Development Bank (NDB) and also the Asian Infrastructure Investment Bank (AIIB). How will the role of the two Banks be different? Discuss the strategic significance of these two Banks for India.",
            "tags": [
                "International Relations",
                "2014",
                "UPSC"
            ]
        },
        "child21": {
            "question": "Q. WTO is an important international institution where decisions taken affect countries in a profound manner. What is the mandate of WTO and how binding are their decisions? Critically analyse India’s stand on the latest round of talks on Food security.",
            "tags": [
                "International Relations",
                "2014",
                "UPSC"
            ]
        },
        "child22": {
            "question": "Q. The proposed withdrawal of International Security Assistance Force (ISAF) from Afghanistan in 2014 is fraught with major security implications for the countries of the region. Examine in light of the fact that India is faced with a plethora of challenges and needs to safeguard its own strategic interests.",
            "tags": [
                "International Relations",
                "2013",
                "UPSC"
            ]
        },
        "child23": {
            "question": "Q. What do you understand by ‘The String of Pearls’? How does it impact India? Briefly outline the steps taken by India to counter this.",
            "tags": [
                "International Relations",
                "2013",
                "UPSC"
            ]
        },
        "child24": {
            "question": "Q. Economic ties between India and Japan while growing in the recent years are still far below their potential. Elucidate the policy constraints which are inhibiting this growth.",
            "tags": [
                "International Relations",
                "2013",
                "UPSC"
            ]
        },
        "child25": {
            "question": "Q. The protests in Shahbag Square in Dhaka in Bangladesh reveal a fundamental split in society between the nationalists and Islamic forces. What is its significance for India?",
            "tags": [
                "International Relations",
                "2013",
                "UPSC"
            ]
        },
        "child26": {
            "question": "Q. Discuss the political developments in Maldives in the last two years. Should they be of any cause of concern to India?",
            "tags": [
                "International Relations",
                "2013",
                "UPSC"
            ]
        },
        "child27": {
            "question": "Q. In respect of India-Sri Lanka relations, discuss how domestic factors influence foreign policy.",
            "tags": [
                "International Relations",
                "2013",
                "UPSC"
            ]
        },
        "child28": {
            "question": "Q. What is meant by Gujral doctrine? Does it have any relevance today? Discuss.",
            "tags": [
                "International Relations",
                "2013",
                "UPSC"
            ]
        },
        "child29": {
            "question": "Q. The World Bank and the IMF, collectively known as the Bretton Woods Institutions, are the two inter-governmental pillars supporting the structure of the world’s economic and financial order. Superficially, the World Bank and the IMF exhibit many common characteristics, yet their role, functions and mandate are distinctly different. Elucidate.",
            "tags": [
                "International Relations",
                "2013",
                "UPSC"
            ]
        }
    }
}