{
    "title": "Internal Security",
    "child": {
        "child1": {
            "question": "Q. China-Pakistan Economic Corridor (CPEC) is viewed as a cardinal subset of China’s larger ‘One Belt One Road’ initiative. Give a brief description of CPEC and enumerate the reasons why India has distanced itself from the same.                      ",
            "tags": [
                "Internal Security",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. Left Wing Extremism (LWE) is showing a downward trend, but still affects many parts of the country. Briefly explain the Government of India’s approach to counter the challenges posed by LWE. ",
            "tags": [
                "Internal Security",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. Data security has assumed significant importance in the digitized world due to rising cyber crimes. The Justice B.N. Srikrishna Committee Report addresses issues related to data security. What, in your view, are the strengths and weaknesses of the Report relating to protection of personal data in cyber space? ",
            "tags": [
                "Internal Security",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. India’s proximity to the two of the world’s biggest illicit opium growing states has enhanced her internal security concerns. Explain the linkages between drug trafficking and other illicit activities such as gunrunning, money laundering and human trafficking. What counter measures should be taken to prevent the same? ",
            "tags": [
                "Internal Security",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. Discuss the potential threats of Cyber attack and the security framework to prevent it.",
            "tags": [
                "Internal Security",
                "2017",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. The North-Eastern region of India has been infested with insurgency for a very long time. Analyze the major reasons for the survival of armed insurgency in this region.",
            "tags": [
                "Internal Security",
                "2017",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. Mob violence is emerging as a serious law and order problem in India. By giving suitable examples, analyze the causes and consequences of such violence.",
            "tags": [
                "Internal Security",
                "2017",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. The scourge of terrorism is a grave challenge to national security. What solutions do you suggest to curb this growing menace? What are the major sources of terrorist funding?",
            "tags": [
                "Internal Security",
                "2017",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. The terms ‘Hot Pursuit’ and ‘Surgical Strikes’ are often used in connection with armed action against terrorist attacks. Discuss the strategic impact of such actions.",
            "tags": [
                "Internal Security",
                "2016",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. ‘Terrorism is emerging as a competitive industry over the last few decades.” Analyse the above statement.",
            "tags": [
                "Internal Security",
                "2016",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. Border management is a complex task due to difficult terrain and hostile relations with some countries. Elucidate the challenges and strategies for effective border management.",
            "tags": [
                "Internal Security",
                "2016",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. Use of internet and social media by non-state actors for subversive activities is a major security concern. How have these been misused in the recent past? Suggest effective guidelines to curb the above threat.",
            "tags": [
                "Internal Security",
                "2016",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. Discuss the advantages and security implications of cloud hosting of servers vis-a-vis in-house machine-based hosting for government businesses.",
            "tags": [
                "Internal Security",
                "2015",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. Human right activists constantly highlight the view that the Armed Forces (Special Powers) Act, 1958 (AFSPA) is a draconian act leading to cases of human rights abuses by the security forces. What sections of AFSPA are opposed by the activists? Critically evaluate the requirement with reference to the view held by the Apex Court.",
            "tags": [
                "Internal Security",
                "2015",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. Religious indoctrination via digital media has resulted in Indian youth joining the ISIS. What is ISIS and its mission? How can ISIS be dangerous to the internal security of our country?",
            "tags": [
                "Internal Security",
                "2015",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. The persisting drives of the Government for development of large industries in backward areas have resulted in isolating the tribal population and the farmers who face multiple displacements. With Malkangiri and Naxalbari foci, discuss the corrective strategies needed to win the Left Wing Extremism (LWE) doctrine affected citizens back into the mainstream of social and economic growth.",
            "tags": [
                "Internal Security",
                "2015",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. Considering the threats cyberspace poses for the country, India needs a “Digital Armed Forces” to prevent crimes. Critically evaluate the National Cyber Security Policy, 2013 outlining the challenges perceived in its effective implementation.",
            "tags": [
                "Internal Security",
                "2015",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. “The diverse nature of India as a multi-religious and multi-ethnic society is not immune to the impact of radicalism which is seen in her neighbourhood.” Discuss along with strategies to be adopted to counter this environment.",
            "tags": [
                "Internal Security",
                "2014",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. International civil aviation laws provide all countries complete and exclusive sovereignty over the airspace above their territory. What do you understand by ‘airspace? What are the implications of these laws on the space above this airspace? Discuss the challenges which this poses and suggest ways to contain the threat.",
            "tags": [
                "Internal Security",
                "2014",
                "UPSC"
            ]
        },
        "child20": {
            "question": "Q. How does illegal transborder migration pose a threat to India’s security? Discuss the strategies to curb this, bringing out the factors which give impetus to such migration.",
            "tags": [
                "Internal Security",
                "2014",
                "UPSC"
            ]
        },
        "child21": {
            "question": "Q. In 2012, the longitudinal marking for high-risk areas for piracy was moved from 65 degrees east to 78 degrees east in the Arabian Sea by the International Maritime Organization. What impact does this have on India’s maritime security concerns?",
            "tags": [
                "Internal Security",
                "2014",
                "UPSC"
            ]
        },
        "child22": {
            "question": "Q. China and Pakistan have entered into an agreement for development of an economic corridor. What threat does this pose for India’s security? Critically examine.",
            "tags": [
                "Internal Security",
                "2014",
                "UPSC"
            ]
        },
        "child23": {
            "question": "Q. Money laundering poses a serious security threat to a country’s economic sovereignty. What is its significance for India and what steps are required to be taken to control this menace?",
            "tags": [
                "Internal Security",
                "2013",
                "UPSC"
            ]
        },
        "child24": {
            "question": "Q. What are social networking sites and what security implications do these sites present?",
            "tags": [
                "Internal Security",
                "2013",
                "UPSC"
            ]
        },
        "child25": {
            "question": "Q. Cyber warfare is considered by some defense analysts to be a larger threat than even Al Qaeda or terrorism. What do you understand by Cyber warfare? Outline the cyber threats which India is vulnerable to and bring out the state of the country’s preparedness to deal with the same.",
            "tags": [
                "Internal Security",
                "2013",
                "UPSC"
            ]
        },
        "child26": {
            "question": "Q. Article 244 of the Indian Constitution relates to administration of scheduled areas and tribal areas. Analyse the impact of non-implementation of the provisions of the Fifth schedule on the growth of Left Wing extremism.",
            "tags": [
                "Internal Security",
                "2013",
                "UPSC"
            ]
        },
        "child27": {
            "question": "Q. How far are India’s internal security challenges linked with border management particularly in view of the long porous borders with most countries of South Asia and Myanmar?",
            "tags": [
                "Internal Security",
                "2013",
                "UPSC"
            ]
        }
    }
}