{
    "title": "Polity",
    "child": {
        "child1": {
            "question": "Q. the light of recent controversy regarding the use of Electronic Voting Machine (EVM), what are the challenges before the Election Commission of India to ensure the trustworthiness of elections in India? ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. Whether National Commission for Scheduled Castes (NCSC) can enforce the implementation of constitutional reservation for the Scheduled Castes in the religious minority institutions? Examine. ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. Under what circumstances can the Financial Emergency be proclaimed by the President of India? What consequences follow when such a declaration remain in force? ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. Why do you think the committees are considered to be useful for parliamentary work? Discuss, in this context, the role of the Estimates Committee. ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. “The Comptroller and Auditor General (CAG) has a very vital role to play.” Explain how this is reflected in the method and terms of his appointment as well as the range of powers he can exercise. ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. Whether the Supreme Court Judgment (July 2018) can settle the political tussle between the Lt. Governor and elected government of Delhi? Examine. ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. How far do you agree with the view that tribunals curtail the jurisdiction of ordinary courts? In view of the above, discuss the constitutional validity and competency of the tribunals in India? ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. India and USA are the two large democracies. Examine the basic tenets on which the two political systems are based. ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. How is the Finance Commission of India constituted? What do you know about the terms of reference of the recently constituted Finance Commission? Discuss. ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. Assess the importance of the Panchayat system in India as a part of local government. Apart from government grants, what sources the Panchayats can look out for financing development projects? ",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. Multiplicity of various commissions for the vulnerable sections of the society leads to problems of overlapping jurisdiction & duplication of functions. Is it better to merge all commissions into an umbrella human rights commission? Argue your case.",
            "tags": [
                "Polity",
                "2018",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. “The local self government system in India has not proved to be effective instrument of governance”. Critically examine the statement and give your views to improve the situation.",
            "tags": [
                "Polity",
                "2017",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. Critically examine the Supreme Court’s judgement on ‘National Judicial Appointments Commission Act, 2014’ with reference to appointment of judges of higher judiciary in India.",
            "tags": [
                "Polity",
                "2017",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. ‘Simultaneous election to the Lok Sabha and the State Assemblies will limit the amount of time and money spent in electioneering but it will reduce the government’s accountability to the people’ Discuss.",
            "tags": [
                "Polity",
                "2017",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. How do pressure groups influence Indian political process? Do you agree with this view that informal pressure groups have emerged as powerful as formal pressure groups in recent years?",
            "tags": [
                "Polity",
                "2017",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. Explain the salient features of the constitution (One Hundred and First Amendment) Act, 20Q. Do you think it is efficacious enough ‘to remove cascading effect of taxes and provide for common national market for goods and services’?",
            "tags": [
                "Polity",
                "2017",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. Examine the scope of Fundamental Rights in the light of the latest judgement of the Supreme Court on Right to Privacy.",
            "tags": [
                "Polity",
                "2017",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. The Indian Constitution has provisions for holding a joint session of the two houses of the Parliament. Enumerate the occasions when this would normally happen and also the occasions when it cannot, with reasons thereof.",
            "tags": [
                "Polity",
                "2017",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. To enhance the quality of democracy in India the Election Commission of India has proposed electoral reforms in 2016. What are the suggested reforms and how far are they significant to make democracy successful?",
            "tags": [
                "Polity",
                "2017",
                "UPSC"
            ]
        },
        "child20": {
            "question": "Q. Discuss the essentials of the 69th Constitutional Amendment Act and anomalies, if any, that have led to recent reported conflicts between the elected representatives and institution of Lieutenant Governor in the administration of Delhi. Do you think that this will give rise to a new trend in the functioning of the Indian Federal Politics?",
            "tags": [
                "Polity",
                "2016",
                "UPSC"
            ]
        },
        "child21": {
            "question": "Q. To what extent is Article 370 of the Indian Constitution, bearing marginal note “Temporary provision with respect to the State of Jammu and Kashmir”, temporary? Discuss the future prospects of this provision in the context of Indian polity.",
            "tags": [
                "Polity",
                "2016",
                "UPSC"
            ]
        },
        "child22": {
            "question": "Q. “The Indian party system is passing through a phase of transition which looks to be full of contradictions and paradoxes.” Discuss.",
            "tags": [
                "Polity",
                "2016",
                "UPSC"
            ]
        },
        "child23": {
            "question": "Q. Exercise of CAG’s powers in relation to the accounts of the Union and the States is derived from Article 149 of the Indian Constitution. Discuss whether audit of the Government’s policy implementation could amount to overstepping its own (CAG) jurisdiction.",
            "tags": [
                "Polity",
                "2016",
                "UPSC"
            ]
        },
        "child24": {
            "question": "Q. Discuss each adjective attached to the word ‘Republic’ in the ‘Preamble’. Are they defendable in the present circumstances?",
            "tags": [
                "Polity",
                "2016",
                "UPSC"
            ]
        },
        "child25": {
            "question": "Q. What was held in the Coelho case? In this context, can you say that judicial review is of key importance amongst the basic features of the Constitution?",
            "tags": [
                "Polity",
                "2016",
                "UPSC"
            ]
        },
        "child26": {
            "question": "Q. Did the Government of India Act, 1935 lay down a federal constitution? Discuss.",
            "tags": [
                "Polity",
                "2016",
                "UPSC"
            ]
        },
        "child27": {
            "question": "Q. What is quasi judicial body? Explain with the help of concrete examples.",
            "tags": [
                "Polity",
                "2016",
                "UPSC"
            ]
        },
        "child28": {
            "question": "Q. Discuss the possible factors that inhibit India from enacting for its citizen a uniform civil code as provided for in the Directive Principles of State Policy.",
            "tags": [
                "Polity",
                "2015",
                "UPSC"
            ]
        },
        "child29": {
            "question": "Q. The concept of cooperative federalism has been increasingly emphasised in recent years. Highlight the drawbacks in the existing structure and the extent to which cooperative federalism would answer the shortcomings.",
            "tags": [
                "Polity",
                "2015",
                "UPSC"
            ]
        },
        "child30": {
            "question": "Q. In absence of well–educated and organised local level government system, ‘Panchayats’ and ‘Samitis’ have remained mainly political institutions and not effective instruments of governance. Critically discuss.",
            "tags": [
                "Polity",
                "2015",
                "UPSC"
            ]
        },
        "child31": {
            "question": "Q. Khap panchayats have been in the news for functioning as extra–constitutional authorities, often delivering pronouncements amounting to human rights violations. Discuss critically the actions taken by the legislative, executive and the judiciary to set the things right in this regard.",
            "tags": [
                "Polity",
                "2015",
                "UPSC"
            ]
        },
        "child32": {
            "question": "Q. Resorting to ordinances has always raised concern on violation of the spirit of separation of powers doctrine. While noting the rationales justifying the power to promulgate ordinances, analyse whether the decisions of the Supreme Court on the issue have further facilitated resorting to this power. Should the power to promulgate the ordinances be repealed?",
            "tags": [
                "Polity",
                "2015",
                "UPSC"
            ]
        },
        "child33": {
            "question": "Q. What are the major changes brought in the Arbitration and Conciliation Act, 1996 through the recent Ordinance promulgated by the President? How far will it improve India’s dispute resolution mechanism? Discuss.",
            "tags": [
                "Polity",
                "2015",
                "UPSC"
            ]
        },
        "child34": {
            "question": "Q. Does the right to clean environment entail legal regulation on burning crackers during Diwali? Discuss in the light of Article 21 of Indian Constitution and Judgement(s) of the Apex court in this regard.",
            "tags": [
                "Polity",
                "2015",
                "UPSC"
            ]
        },
        "child35": {
            "question": "Q. Starting from inventing the ‘basic structure’ doctrine, the judiciary has played a highly proactive role in ensuring that India develops into a thriving democracy. In light of the statement, evaluate the role played by judicial activism in achieving the ideals of democracy.",
            "tags": [
                "Polity",
                "2014",
                "UPSC"
            ]
        },
        "child36": {
            "question": "Q. Though the federal principle is dominant in our Constitution and that principle is one of its basic features, but it is equally true that federalism under the Indian Constitution leans in favour of a strong Centre, a feature that militates against the concept of strong federalism. Discuss.",
            "tags": [
                "Polity",
                "2014",
                "UPSC"
            ]
        },
        "child37": {
            "question": "Q. The ‘Powers, Privileges and Immunities of Parliament and its Members’ as envisaged in Article 105 of the Constitution leave room for a large number of un-codified and un-enumerated privileges to continue. Assess the reasons for the absence of legal codification of the ‘parliamentary privileges’. How can this problem be addressed?",
            "tags": [
                "Polity",
                "2014",
                "UPSC"
            ]
        },
        "child38": {
            "question": "Q. What do you understand by the concept “freedom of speech and expression”? Does it cover hate speech also? Why do the films in India stand on a slightly different plane from other forms of expression? Discuss.",
            "tags": [
                "Polity",
                "2014",
                "UPSC"
            ]
        },
        "child39": {
            "question": "Q. Instances of President’s delay in commuting death sentences has come under public debate as denial of justice. Should there be a time limit specified for the President to accept/reject such petitions? Analyse.",
            "tags": [
                "Polity",
                "2014",
                "UPSC"
            ]
        },
        "child40": {
            "question": "Q. National Human Rights Commission (NHRC) in India can be most effective when its tasks are adequately supported by other mechanisms that ensure the accountability of a government. In light of the above observation assess the role of NHRC as an effective complement to the judiciary and other institutions in promoting and protecting human rights standards.",
            "tags": [
                "Polity",
                "2014",
                "UPSC"
            ]
        },
        "child41": {
            "question": "Q. The role of individual MPs (Members of Parliament) has diminished over the years and as a result healthy constructive debates on policy issues are not usually witnessed. How far can this be attributed to the anti-defection law which was legislated but with a different intention?",
            "tags": [
                "Polity",
                "2013",
                "UPSC"
            ]
        },
        "child42": {
            "question": "Q. Discuss Section 66A of IT Act, with reference to its alleged violation of Article 19 of the Constitution.",
            "tags": [
                "Polity",
                "2013",
                "UPSC"
            ]
        },
        "child43": {
            "question": "Q. Recent directives from Ministry of Petroleum and Natural Gas are perceived by the ‘Nagas’ as a threat to override the exceptional status enjoyed by the State. Discuss in light of Article 371A of the Indian Constitution.",
            "tags": [
                "Polity",
                "2013",
                "UPSC"
            ]
        },
        "child44": {
            "question": "Q. ‘The Supreme Court of India keeps a check on arbitrary power of the Parliament in amending the Constitution.’ Discuss critically.",
            "tags": [
                "Polity",
                "2013",
                "UPSC"
            ]
        },
        "child45": {
            "question": "Q. Constitutional mechanisms to resolve the inter-state water disputes have failed to address and solve the problems. Is the failure due to structural or process inadequacy or both? Discuss.",
            "tags": [
                "Polity",
                "2013",
                "UPSC"
            ]
        },
        "child46": {
            "question": "Q. Pressure group politics is sometimes seen as the informal face of politics. With regards to the above, assess the structure and functioning of pressure groups in India.",
            "tags": [
                "Polity",
                "2013",
                "UPSC"
            ]
        }
    }
}