{
    "title": "Science & Technology",
    "child": {
        "child1": {
            "question": "Q. the work of ‘Bose-Einstein Statistics’ done by Prof. Satyendra Nath Bose and show how it revolutionized the field of Physics. ",
            "tags": [
                "Science & Technology",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. Why is there so much activity in the field of biotechnology in our country? How has this activity benefitted the field of biopharma? ",
            "tags": [
                "Science & Technology",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. With growing energy needs should India keep on expanding its nuclear energy programme? Discuss the facts and fears associated with nuclear energy?",
            "tags": [
                "Science & Technology",
                "2018",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. Stem cell therapy is gaining popularity in India to treat a wide variety of medical conditions including Leukaemia, Thalassemia, damaged cornea and several burns. Describe briefly what stem cell therapy is and what advantages it has over other treatments?",
            "tags": [
                "Science & Technology",
                "2017",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. India has achieved remarkable successes in unmanned space missions including the Chandrayaan and Mars Orbiter Mission, but has not ventured into manned space mission. What are the main obstacles to launching a manned space mission, both in terms of technology and logistics? Examine critically.",
            "tags": [
                "Science & Technology",
                "2017",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. Give an account of the growth and development of nuclear science and technology in India. What is the advantage of fast breeder reactor programme in India?",
            "tags": [
                "Science & Technology",
                "2017",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. Discuss India’s achievements in the field of Space Science and Technology. How the application of this technology has helped India in its socio-economic development?",
            "tags": [
                "Science & Technology",
                "2016",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. Why is nanotechnology one of the key technologies of the 21st century? Describe the salient features of Indian Government’s Mission on Nanoscience and Technology and the scope of its application in the development process of the country.",
            "tags": [
                "Science & Technology",
                "2016",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. What do you understand by ‘Standard Positioning System’ and ‘Precision Positioning System’ in the GPS era? Discuss the advantages India perceives from its ambitious IRNSS programme employing just seven satellites.",
            "tags": [
                "Science & Technology",
                "2015",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. What are the areas of prohibitive labour that can be sustainably managed by robots? Discuss the initiatives that can propel research in premier research institutes for substantive and gainful innovation.",
            "tags": [
                "Science & Technology",
                "2015",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. India’s Traditional Knowledge Digital Library (TKDL), which has a database containing formatted information on more than 2 million medicinal formulations is proving a powerful weapon in country’s fight against erroneous patents. Discuss the pros and cons of making this database publicly available under open-source licensing.",
            "tags": [
                "Science & Technology",
                "2015",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. Scientific research in Indian universities is declining, because a career in science is not as attractive as are business professions, engineering or administration, and the universities are becoming consumer-oriented. Critically comment.",
            "tags": [
                "Science & Technology",
                "2014",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. Can overuse and free availability of antibiotics without Doctor’s prescription, be contributors to the emergence of drug-resistant diseases in India? What are the available mechanisms for monitoring and control? Critically discuss the various issues involved.",
            "tags": [
                "Science & Technology",
                "2014",
                "UPSC"
            ]
        },
        "child14": {
            "question": "Q. In a globalized world, Intellectual Property Rights assume significance and are a source of litigation. Broadly distinguish between the terms—Copyrights, Patents and Trade Secrets.",
            "tags": [
                "Science & Technology",
                "2014",
                "UPSC"
            ]
        },
        "child15": {
            "question": "Q. Bringing out the circumstances in 2005 which forced amendment to the section 3(d) in Indian Patent Law, 1970, discuss how it has been utilized by the Supreme Court in its judgement in rejecting Novratis’ patent application for ‘Glivec’. Discuss briefly the pros and cons of the decision.",
            "tags": [
                "Science & Technology",
                "2013",
                "UPSC"
            ]
        },
        "child16": {
            "question": "Q. What do you understand by Fixed Dose Drug Combinations (FDCs)? Discuss their merits and demerits.",
            "tags": [
                "Science & Technology",
                "2013",
                "UPSC"
            ]
        },
        "child17": {
            "question": "Q. What do you understand by Umpire Decision Review System in Cricket? Discuss its various components. Explain how silicone tape on the edge of a bat may fool the system?",
            "tags": [
                "Science & Technology",
                "2013",
                "UPSC"
            ]
        },
        "child18": {
            "question": "Q. (a) What is a digital signature ? What does its authentication mean? Give various salient built-in features of a digital signature. (b) How does the 3D printing technology work? List out the advantages and disadvantages of the technology.",
            "tags": [
                "Science & Technology",
                "2013",
                "UPSC"
            ]
        },
        "child19": {
            "question": "Q. (a) What is an FRP composite material ? How are they manufactured? Discuss their applications in aviation and automobile industries. (b) What do you understand by Run-of-river hydroelectricity project? How is it different from any other hydroelectricity project?",
            "tags": [
                "Science & Technology",
                "2013",
                "UPSC"
            ]
        }
    }
}