{
    "title": "Social Justice",
    "child": {
        "child1": {
            "question": "Q. local community-level healthcare intervention is a prerequisite to achieve ‘Health for All’ in India. Explain.",
            "tags": [
                "Social Justice",
                "2018",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. How far do you agree with the view that the focus on lack of availability of food as the main cause of hunger takes the attention away from ineffective human development policies in India?",
            "tags": [
                "Social Justice",
                "2018",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. ‘To ensure effective implementation of policies addressing water, sanitation and hygiene needs, the identification of beneficiary segments is to be synchronized with the anticipated outcomes’. Examine the statement in the context of the WASH scheme.",
            "tags": [
                "Social Justice",
                "2017",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. Does the Rights of Persons with Disabilities Act, 2016 ensure effective mechanism for empowerment and inclusion of the intended beneficiaries in the society? Discuss.",
            "tags": [
                "Social Justice",
                "2017",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. Hunger and Poverty are the biggest challenges for good governance in India still today. Evaluate how far successive governments have progressed in dealing with these humongous problems. Suggest measures for improvement.",
            "tags": [
                "Social Justice",
                "2017",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. Professor Amartya Sen has advocated important reforms in the realms of primary education and primary health care. What are your suggestions to improve their status and performance?",
            "tags": [
                "Social Justice",
                "2016",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. Examine the main provisions of the National Child Policy and throw light on the status of its implementation.",
            "tags": [
                "Social Justice",
                "2016",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. The quality of higher education in India requires major improvements to make it internationally competitive. Do you think that the entry of foreign educational institutions would help improve the quality of technical and higher education in the country? Discuss.",
            "tags": [
                "Social Justice",
                "2015",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. Public health system has limitations in providing universal health coverage. Do you think that private sector could help in bridging the gap? What other viable alternatives would you suggest?",
            "tags": [
                "Social Justice",
                "2015",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. Though there have been several different estimates of poverty in India, all indicate reduction in poverty levels over time. Do you agree? Critically examine with reference to urban and rural poverty indicators.",
            "tags": [
                "Social Justice",
                "2015",
                "UPSC"
            ]
        },
        "child11": {
            "question": "Q. Do government’s schemes for up-lifting vulnerable and backward communities by protecting required social resources for them, lead to their exclusion in establishing businesses in urban economies?",
            "tags": [
                "Social Justice",
                "2014",
                "UPSC"
            ]
        },
        "child12": {
            "question": "Q. Identify the Millennium Development Goals (MDGs) that are related to health. Discuss the success of the actions taken by the Government for achieving the same.",
            "tags": [
                "Social Justice",
                "2013",
                "UPSC"
            ]
        },
        "child13": {
            "question": "Q. The concept of Mid Day Meal (MDM) scheme is almost a century old in India with early beginnings in Madras Presidency in pre-independent India. The scheme has again been given impetus in most states in the last two decades. Critically examine its twin objectives, latest mandates and success.",
            "tags": [
                "Social Justice",
                "2013",
                "UPSC"
            ]
        }
    }
}