{
    "title": "World History",
    "child": {
        "child1": {
            "question": "Q. What problems were germane to the decolonization process in the Malay Peninsula?",
            "tags": [
                "World History",
                "2017",
                "UPSC"
            ]
        },
        "child2": {
            "question": "Q. The anti-colonial struggles in West Africa were led by the new elite of Western educated Africans. Examine.",
            "tags": [
                "World History",
                "2016",
                "UPSC"
            ]
        },
        "child3": {
            "question": "Q. Why did the industrial revolution first occur in England? Discuss the quality of life of the people there during the industrialization. How does it compare with that in India at present?",
            "tags": [
                "World History",
                "2015",
                "UPSC"
            ]
        },
        "child4": {
            "question": "Q. To what extent can Germany be held responsible for causing the two World Wars? Discuss critically",
            "tags": [
                "World History",
                "2015",
                "UPSC"
            ]
        },
        "child5": {
            "question": "Q. What were the events that led to the Suez Crisis in 1956? How did it deal a final blow to Britain’s self-image as a world power?",
            "tags": [
                "World History",
                "2014",
                "UPSC"
            ]
        },
        "child6": {
            "question": "Q. The New Economic Policy – 1921 of Lenin had influenced the policies adopted by India soon after independence. Evaluate.",
            "tags": [
                "World History",
                "2014",
                "UPSC"
            ]
        },
        "child7": {
            "question": "Q. “‘Latecomer’ Industrial Revolution in Japan involved certain factors that were markedly different from what West had experienced.” Analyze.",
            "tags": [
                "World History",
                "2013",
                "UPSC"
            ]
        },
        "child8": {
            "question": "Q. “Africa was chopped into States artificially created by accidents of European competition.” Analyze.",
            "tags": [
                "World History",
                "2013",
                "UPSC"
            ]
        },
        "child9": {
            "question": "Q. “American Revolution was an economic revolt against mercantilism.” Substantiate.",
            "tags": [
                "World History",
                "2013",
                "UPSC"
            ]
        },
        "child10": {
            "question": "Q. What policy instruments were deployed to contain the Great Economic Depression?",
            "tags": [
                "World History",
                "2013",
                "UPSC"
            ]
        }
    }
}